import{r as e}from"./rolldown-runtime-QTnfLwEv.js";import{t}from"./jsx-runtime-By8HlURe.js";var n=e(t()),r={title:`Абстрактный класс: DataManager`,description:`Документация по плагину абстрактный класс: datamanager для DLE.`},i=new Date(1787145028e3),a=`

## Краткое содержание: [#краткое-содержание]

Абстрактный класс DataManager, представляющий базовый функционал для менеджеров данных.

## Описание: [#описание]

Класс служит основой для реализации логики работы с данными, например, взаимодействия с базой данных.
Конкретные реализации должны быть определены в наследниках этого класса.

***

### Свойства [#свойства]

* protected $[db](#property_db)

***

### Методы [#методы]

* public [abbr()](#method_abbr)
* public [connect()](#method_connect)
* public [createDir()](#method_createDir)
* public [createLockFile()](#method_createLockFile)
* public [defType()](#method_defType)
* public [deleteDir()](#method_deleteDir)
* public [dirToArray()](#method_dirToArray)
* public [getComparer()](#method_getComparer)
* public [getConfig()](#method_getConfig)
* public [getDb()](#method_getDb)
* public [getPrefix()](#method_getPrefix)
* public [getUserPrefix()](#method_getUserPrefix)
* public [joinPaths()](#method_joinPaths)
* public [nameArgs()](#method_nameArgs) - (deprecated)
* public [normalizePath()](#method_normalizePath)
* public [normalizeUrl()](#method_normalizeUrl)
* public [sanitizeArrayInput()](#method_sanitizeArrayInput)
* public [sanitizeInput()](#method_sanitizeInput)
* public [setDb()](#method_setDb)
* public [toTranslit()](#method_toTranslit)
* private [loadJsonConfig()](#method_loadJsonConfig)
* private [migrateOldConfig()](#method_migrateOldConfig)

***

### Подробности [#подробности]

* Путь: engine/inc/maharder/\\_includes/classes/DataManager.php

***

## Свойства [#свойства-1]

<span id="property_db" />

#### protected $db : ?\\db [#protected-db--db]

***

**Краткое содержание**

Статическое свойство для хранения экземпляра базы данных.

**Тип:** <abbr title="?\\db">db</abbr>
Экземпляр базы данных или null, если он не инициализирован.

***

## Методы [#методы-1]

<span id="method_abbr" />

### abbr [#abbr]

\`\`\`
static public abbr(string  string, string  sep = "_") : string
\`\`\`

##### Краткое содержание [#краткое-содержание-1]

Создает аббревиатуру из переданной строки, используя указанное разделение слов.

##### Описание [#описание-1]

Функция извлекает первую букву каждого слова из строки, разделенной указанным
разделителем, и формирует из них аббревиатуру, преобразуя результат в верхний регистр.

##### Смотри так-же: [#смотри-так-же]

##### Свойства: [#свойства-2]

| Название    | Тип    | По умолчанию |
| ----------- | ------ | ------------ |
| **$string** | string |              |
| **$sep**    | string | '\\_'         |

##### Ошибки: [#ошибки]

| Тип                       | Описание                                              |
| ------------------------- | ----------------------------------------------------- |
| \\InvalidArgumentException | Если один из параметров передан с некорректным типом. |

##### Возвращает: [#возвращает]

\`\`\`
string
\`\`\`

Аббревиатура, сформированная из начальных букв всех слов строки в верхнем регистре.

***

<span id="method_connect" />

### connect [#connect]

\`\`\`
static public connect() : void
\`\`\`

##### Краткое содержание [#краткое-содержание-2]

Устанавливает подключение к базе данных, если оно еще не было установлено.

##### Описание [#описание-2]

Если глобальная переменная \`DBHOST\` не определена, подключение
к базе данных конфигурируется через файл \`dbconfig.php\` в папке ENGINE\\_DIR.
В противном случае используется глобальная переменная \`$db\`.

##### Смотри так-же: [#смотри-так-же-1]

* [\\DataManager::setDb()](#method_setDb)

##### Возвращает: [#возвращает-1]

\`\`\`
void
\`\`\`

***

<span id="method_createDir" />

### createDir [#createdir]

\`\`\`
static public createDir(string  service = "DataManager", string  module = "mhadmin", int  permission = 0755, string  ...paths) : bool
\`\`\`

##### Краткое содержание [#краткое-содержание-3]

Создаёт папку(и) по указанным путям с заданными правами доступа.

##### Описание [#описание-3]

Для каждого предоставленного пути создаётся директория, если она ещё не существует.
При возникновении ошибки (например, неудачного создания директории)
ошибка логируется через \`LogGenerator::generate_log\`.

##### Свойства: [#свойства-3]

| Название        | Тип    | По умолчанию  |
| --------------- | ------ | ------------- |
| **$service**    | string | 'DataManager' |
| **$module**     | string | 'mhadmin'     |
| **$permission** | int    | 0755          |
| **$paths**      | string |               |

##### Ошибки: [#ошибки-1]

| Тип                        | Описание                                                              |
| -------------------------- | --------------------------------------------------------------------- |
| \\RuntimeException          | Бросается, если директория не может быть создана.                     |
| \\JsonException\\|\\Throwable | Может быть вызван, если ошибка логирования связана с кодировкой JSON. |

##### Возвращает: [#возвращает-2]

\`\`\`
bool
\`\`\`

Возвращает \`true\`, если все директории успешно созданы, иначе \`false\`.

***

<span id="method_createLockFile" />

### createLockFile [#createlockfile]

\`\`\`
static public createLockFile(string  path) : mixed
\`\`\`

##### Свойства: [#свойства-4]

| Название  | Тип    | По умолчанию |
| --------- | ------ | ------------ |
| **$path** | string |              |

##### Ошибки: [#ошибки-2]

| Тип            | Описание |
| -------------- | -------- |
| \\Throwable     |          |
| \\JsonException |          |

##### Возвращает: [#возвращает-3]

\`\`\`
mixed
\`\`\`

***

<span id="method_defType" />

### defType [#deftype]

\`\`\`
static public defType(mixed  value, string  type) : float|bool|int|string
\`\`\`

##### Краткое содержание [#краткое-содержание-4]

Приводит значение к указанному типу, если возможно, используя набор фильтров.

##### Описание [#описание-4]

Функция принимает значение и тип, преобразует значение к заданному типу с использованием соответствующего
фильтра. Если преобразование невозможно, возвращается строковое представление значения.

Поддерживаемые типы:

* \`double\`, \`float\`: преобразование в число с плавающей точкой.
* \`boolean\`, \`bool\`: преобразование в булево значение.
* \`integer\`, \`int\`, \`tinyint\`: преобразование в целое число.
* \`string\`: фильтрация как строка.

Если указанный тип отсутствует в карте типов, функция возвращает строковое представление значения.

##### Свойства: [#свойства-5]

| Название   | Тип    | По умолчанию |
| ---------- | ------ | ------------ |
| **$value** | mixed  |              |
| **$type**  | string |              |

##### Ошибки: [#ошибки-3]

| Тип         | Описание                                                                        |
| ----------- | ------------------------------------------------------------------------------- |
| \\ValueError | Исключение может быть выброшено, если \`filter_var\` получит некорректный фильтр. |

##### Возвращает: [#возвращает-4]

\`\`\`
float|bool|int|string
\`\`\`

Преобразованное значение в заданный тип, либо строковое представление значения,
если преобразование невозможно или тип неизвестен.

***

<span id="method_deleteDir" />

### deleteDir [#deletedir]

\`\`\`
static public deleteDir(string  path) : void
\`\`\`

##### Краткое содержание [#краткое-содержание-5]

Полностью удаляет директорию и все её содержимое, включая файлы и вложенные директории.

##### Описание [#описание-5]

Эта функция рекурсивно обходит заданный путь, удаляя все файлы и вложенные директории,
а затем удаляет саму директорию. Игнорирует защищённую директорию,
путь к которой жёстко прописан в коде.

##### Свойства: [#свойства-6]

| Название  | Тип    | По умолчанию |
| --------- | ------ | ------------ |
| **$path** | string |              |

##### Ошибки: [#ошибки-4]

| Тип                       | Описание                                                                           |
| ------------------------- | ---------------------------------------------------------------------------------- |
| \\UnexpectedValueException | В случае, если переданный путь не является директорией или не может быть прочитан. |

##### Возвращает: [#возвращает-5]

\`\`\`
void
\`\`\`

***

<span id="method_dirToArray" />

### dirToArray [#dirtoarray]

\`\`\`
static public dirToArray(string  dir, mixed  ..._ext) : array
\`\`\`

##### Краткое содержание [#краткое-содержание-6]

Преобразует указанную директорию в массив, содержащий все папки и файлы из неё.

##### Описание [#описание-6]

Этот метод является обёрткой для функции \`dirToArray\` и вызывает её с переданными
параметрами. Используется для рекурсивного получения структуры директорий и файлов
в виде массива.

##### Смотри так-же: [#смотри-так-же-2]

* [\\dirToArray()](../index#function_dirToArray)

##### Свойства: [#свойства-7]

| Название   | Тип    | По умолчанию |
| ---------- | ------ | ------------ |
| **$dir**   | string |              |
| **$\\_ext** | mixed  |              |

##### Возвращает: [#возвращает-6]

\`\`\`
array
\`\`\`

Ассоциативный массив, где ключами могут быть директории, а значения —
содержимое этих директорий; файлы представлены в виде элементов массива.

***

<span id="method_getComparer" />

### getComparer [#getcomparer]

\`\`\`
static public getComparer(mixed  value) : string
\`\`\`

##### Краткое содержание [#краткое-содержание-7]

Формирует строку, представляющую оператор сравнения и значение, основанную на переданном значении.

##### Описание [#описание-7]

Эта функция анализирует начальный символ переданного значения, чтобы определить оператор сравнения
(например, '=', '\\<', '>', 'LIKE', '\\<>', '\\<=',
'>='). Если переданный оператор — '%', то значение
оборачивается в проценты для использования в операциях LIKE. Если значение начинается с других
специальных символов, оно интерпретируется и оператор определяется автоматически.
При необходимости значение преобразуется в указанный тип.

##### Свойства: [#свойства-8]

| Название   | Тип   | По умолчанию |
| ---------- | ----- | ------------ |
| **$value** | mixed |              |

##### Ошибки: [#ошибки-5]

| Тип                       | Описание                                                              |
| ------------------------- | --------------------------------------------------------------------- |
| \\InvalidArgumentException | Если передано некорректное значение или тип недопустим для обработки. |

##### Возвращает: [#возвращает-7]

\`\`\`
string
\`\`\`

Строка, представляющая оператор сравнения и значение, готовая для использования
в SQL- или других выражениях. Например: " = 'some\\_value'", "\\< 10", или " LIKE
'%abc%'".

***

<span id="method_getConfig" />

### getConfig [#getconfig]

\`\`\`
static public getConfig(string  codename, string|null  path = null, string|null  confName = null) : array
\`\`\`

##### Краткое содержание [#краткое-содержание-8]

Получает конфигурацию на основе указанного кода имени и пути к файлу JSON.

##### Описание [#описание-8]

Метод сначала пытается загрузить конфигурацию из указанного или стандартного пути.
Если файл не найден, он проверяет, указано ли устаревшее имя конфигурации
для выполнения миграции данных. Если миграция невозможна, возвращается пустой массив.

##### Свойства: [#свойства-9]

| Название      | Тип          | По умолчанию |
| ------------- | ------------ | ------------ |
| **$codename** | string       |              |
| **$path**     | string\\|null | null         |
| **$confName** | string\\|null | null         |

##### Ошибки: [#ошибки-6]

| Тип               | Описание                                                            |
| ----------------- | ------------------------------------------------------------------- |
| \\JsonException    | Если содержимое JSON-файла некорректно при вызове \`loadJsonConfig\`. |
| \\RuntimeException | Если ошибка возникает во время миграции конфигурации.               |

##### Возвращает: [#возвращает-8]

\`\`\`
array
\`\`\`

Возвращает массив конфигурации. Если файл или миграция недоступны, возвращается пустой массив.

***

<span id="method_getDb" />

### getDb [#getdb]

\`\`\`
static public getDb() : \\db
\`\`\`

##### Краткое содержание [#краткое-содержание-9]

Возвращает объект подключения к базе данных.

##### Описание [#описание-9]

Если подключение еще не было установлено, метод инициирует его вызовом метода connect().

##### Смотри так-же: [#смотри-так-же-3]

* [\\DataManager:connect()](#method_connect)
* [\\DataManager::$db](#property_db)

##### Возвращает: [#возвращает-9]

\`\`\`
\\db
\`\`\`

Объект подключения к базе данных.

***

<span id="method_getPrefix" />

### getPrefix [#getprefix]

\`\`\`
static public getPrefix() : string
\`\`\`

##### Краткое содержание [#краткое-содержание-10]

Возвращает префикс, заданный в системе.

##### Возвращает: [#возвращает-10]

\`\`\`
string
\`\`\`

Префикс, используемый в системе.

***

<span id="method_getUserPrefix" />

### getUserPrefix [#getuserprefix]

\`\`\`
static public getUserPrefix() : string
\`\`\`

##### Краткое содержание [#краткое-содержание-11]

Получает префикс пользователя.

##### Описание [#описание-10]

Данный метод возвращает значение константы \`USERPREFIX\`.

##### Возвращает: [#возвращает-11]

\`\`\`
string
\`\`\`

Префикс пользователя.

***

<span id="method_joinPaths" />

### joinPaths [#joinpaths]

\`\`\`
public joinPaths(string  ...paths) : string
\`\`\`

##### Краткое содержание [#краткое-содержание-12]

Объединяет несколько путей в один.

##### Описание [#описание-11]

Объединение происходит слева направо. Пустые значения игнорируются.
Возвращаемый путь нормализуется (лишние символы удаляются, контролируется корректность пути).

##### Свойства: [#свойства-10]

| Название   | Тип    | По умолчанию |
| ---------- | ------ | ------------ |
| **$paths** | string |              |

##### Ошибки: [#ошибки-7]

| Тип               | Описание                                     |
| ----------------- | -------------------------------------------- |
| \\RuntimeException | Если произошла ошибка при нормализации пути. |

##### Возвращает: [#возвращает-12]

\`\`\`
string
\`\`\`

Возвращает объединённый и нормализованный путь.

***

<span id="method_nameArgs" />

### nameArgs [#nameargs]

\`\`\`
(deprecated) - static public nameArgs(array|null  args) : array
\`\`\`

##### Краткое содержание [#краткое-содержание-13]

Преобразует переданный массив в плоский массив ключ-значение, удаляя пустые значения.

##### Описание [#описание-12]

Метод принимает массив (или null) и возвращает новый массив,
где все вложенные массивы разворачиваются в плоскую структуру.
Для элементов с числовыми ключами их значения назначаются в виде ключей и значений одновременно.
Пустые строки или \`null\` удаляются из итогового массива.

**Устарело**
Устарело с версии PHP 8.1. Рекомендуется использовать альтернативные методы для работы с массивами.

##### Свойства: [#свойства-11]

| Название  | Тип         | По умолчанию |
| --------- | ----------- | ------------ |
| **$args** | array\\|null |              |

##### Ошибки: [#ошибки-8]

| Тип                       | Описание                                          |
| ------------------------- | ------------------------------------------------- |
| \\InvalidArgumentException | Если аргумент $args содержит некорректные данные. |

##### Возвращает: [#возвращает-13]

\`\`\`
array
\`\`\`

Плоский массив ключ-значение, где пустые строки и \`null\` исключены.

***

<span id="method_normalizePath" />

### normalizePath [#normalizepath]

\`\`\`
static public normalizePath(string  path) : string
\`\`\`

##### Краткое содержание [#краткое-содержание-14]

Нормализует путь, очищая его от лишних управляющих символов, точек и других нежелательных элементов.

##### Описание [#описание-13]

Эта функция:

* Удаляет управляющие символы и преобразует все обратные слэши (\`\\\`) в прямые (\`/\`).
* Убирает текущую (\`.\`) и родительскую (\`..\`) директории из пути.
* Удаляет корневой каталог (ROOT\\_DIR), если путь начинается с него.
* Гарантирует, что путь на Linux начинается с символа \`/\`.

##### Свойства: [#свойства-12]

| Название  | Тип    | По умолчанию |
| --------- | ------ | ------------ |
| **$path** | string |              |

##### Ошибки: [#ошибки-9]

| Тип                       | Описание                                                           |
| ------------------------- | ------------------------------------------------------------------ |
| \\InvalidArgumentException | Если константа ROOT\\_DIR не определена или имеет недопустимый тип. |

##### Возвращает: [#возвращает-14]

\`\`\`
string
\`\`\`

Нормализованный путь.
Возвращается пустая строка, если входной путь содержит недопустимые символы (например, управляющие символы).

***

<span id="method_normalizeUrl" />

### normalizeUrl [#normalizeurl]

\`\`\`
static public normalizeUrl(string  url, array  additionalQuery = []) : string
\`\`\`

##### Краткое содержание [#краткое-содержание-15]

Нормализует указанный URL, добавляя дополнительные параметры запроса при необходимости.

##### Описание [#описание-14]

Если URL содержит схему или начинается с двойного слэша, возвращается исходный URL без изменений.
Если URL не содержит схему, добавляется базовый URL, который формируется на основе конфигурации \`$config\`.
Если путь в URL является относительным, он также дополняется базовым URL.

##### Свойства: [#свойства-13]

| Название             | Тип    | По умолчанию |
| -------------------- | ------ | ------------ |
| **$url**             | string |              |
| **$additionalQuery** | array  | \\[]          |

##### Возвращает: [#возвращает-15]

\`\`\`
string
\`\`\`

Нормализованный URL.

***

<span id="method_sanitizeArrayInput" />

### sanitizeArrayInput [#sanitizearrayinput]

\`\`\`
static public sanitizeArrayInput(mixed  input = null, array|null  flags = null) : mixed
\`\`\`

##### Краткое содержание [#краткое-содержание-16]

Очищает входные данные, массивы или значения, используя заданные флаги для фильтрации.

##### Описание [#описание-15]

Если входные данные являются массивом, рекурсивно применяется функция очистки ко всем элементам массива.
Если входные данные - одно значение, применяется очистка непосредственно к нему.

##### Свойства: [#свойства-14]

| Название   | Тип         | По умолчанию |
| ---------- | ----------- | ------------ |
| **$input** | mixed       | null         |
| **$flags** | array\\|null | null         |

##### Возвращает: [#возвращает-16]

\`\`\`
mixed
\`\`\`

Очищенные данные. Если входные данные - массив, возвращается очищенный массив. Если данные не
заданы, возвращается null.

***

<span id="method_sanitizeInput" />

### sanitizeInput [#sanitizeinput]

\`\`\`
static public sanitizeInput(mixed|null  value = null, array|null  flags = null) : string|null
\`\`\`

##### Краткое содержание [#краткое-содержание-17]

Обрабатывает и фильтрует входящее значение на основе заданных флагов.

##### Описание [#описание-16]

Эта функция принимает значение и массив флагов фильтрации, которые применяются
к значению последовательно, используя функцию \`filter_var\`.

##### Свойства: [#свойства-15]

| Название   | Тип         | По умолчанию |
| ---------- | ----------- | ------------ |
| **$value** | mixed\\|null | null         |
| **$flags** | array\\|null | null         |

##### Возвращает: [#возвращает-17]

\`\`\`
string|null
\`\`\`

Возвращает отфильтрованное значение в виде строки или \`null\` в случае, если
значение или фильтрация недействительны.

***

<span id="method_setDb" />

### setDb [#setdb]

\`\`\`
static public setDb(\\db|null  db) : void
\`\`\`

##### Краткое содержание [#краткое-содержание-18]

Устанавливает экземпляр базы данных.

##### Описание [#описание-17]

Метод задает объект базы данных, который будет использоваться в дальнейшем.

##### Смотри так-же: [#смотри-так-же-4]

* [\\DataManager::$db](#property_db)

##### Свойства: [#свойства-16]

| Название | Тип       | По умолчанию |
| -------- | --------- | ------------ |
| **$db**  | \\db\\|null |              |

##### Возвращает: [#возвращает-18]

\`\`\`
void
\`\`\`

***

<span id="method_toTranslit" />

### toTranslit [#totranslit]

\`\`\`
static public toTranslit(string  input, bool  lowercase = true) : string
\`\`\`

##### Краткое содержание [#краткое-содержание-19]

Конвертирует строку в транслитерацию, форматирует её и удаляет нежелательные символы.

##### Описание [#описание-18]

Эта функция выполняет трансформацию текста с учетом заданного функционала:

* Преобразует строку в транслит с использованием Transliterator или функции \`totranslit()\`,
  если Transliterator недоступен.
* Удаляет все символы, кроме букв, цифр и пробелов.
* Заменяет пробелы на символы подчеркивания.
* Приводит строку к нижнему регистру.

Функция упрощает создание URL-совместимых или SEO-оптимизированных строк из произвольных
текстовых данных.

##### Свойства: [#свойства-17]

| Название       | Тип    | По умолчанию |
| -------------- | ------ | ------------ |
| **$input**     | string |              |
| **$lowercase** | bool   | true         |

##### Ошибки: [#ошибки-10]

| Тип               | Описание                                                                                              |
| ----------------- | ----------------------------------------------------------------------------------------------------- |
| \\RuntimeException | Если ни один из механизмов транслитерации, Transliterator или totranslit, недоступен или некорректен. |

##### Возвращает: [#возвращает-19]

\`\`\`
string
\`\`\`

Отформатированная строка, приведенная к нижнему регистру, состоящая из
символов латиницы, цифр и подчеркиваний.

***

<span id="method_loadJsonConfig" />

### loadJsonConfig [#loadjsonconfig]

\`\`\`
static private loadJsonConfig(string  filePath) : array
\`\`\`

##### Краткое содержание [#краткое-содержание-20]

Загружает JSON-конфигурацию из указанного файла и возвращает её в виде массива.

##### Описание [#описание-19]

Функция читает содержимое файла, парсит его как JSON и возвращает массив данных.
Если элементы данных не являются массивами, они проходят фильтрацию с использованием
\`FILTER_SANITIZE_FULL_SPECIAL_CHARS\`.

##### Свойства: [#свойства-18]

| Название      | Тип    | По умолчанию |
| ------------- | ------ | ------------ |
| **$filePath** | string |              |

##### Ошибки: [#ошибки-11]

| Тип               | Описание                                           |
| ----------------- | -------------------------------------------------- |
| \\JsonException    | Если произошла ошибка при парсинге JSON.           |
| \\RuntimeException | Если файл не существует или недоступен для чтения. |

##### Возвращает: [#возвращает-20]

\`\`\`
array
\`\`\`

Ассоциативный массив, содержащий данные из файла JSON.

***

<span id="method_migrateOldConfig" />

### migrateOldConfig [#migrateoldconfig]

\`\`\`
static private migrateOldConfig(string  codename, string  confName, string  configPath) : array
\`\`\`

##### Краткое содержание [#краткое-содержание-21]

Мигрирует старый файл конфигурации в новый JSON-формат.

##### Описание [#описание-20]

Функция проверяет наличие старого конфигурационного файла, преобразует его
содержимое в новый формат, сохраняет в указанной директории в формате JSON и
удаляет старый файл. Если файл отсутствует или содержит некорректный формат данных,
выполняются соответствующие обработки ошибок и возвращается пустой массив.

##### Смотри так-же: [#смотри-так-же-5]

* [\\LogGenerator::generateLog()](./LogGenerator#method_generateLog)

##### Свойства: [#свойства-19]

| Название        | Тип    | По умолчанию |
| --------------- | ------ | ------------ |
| **$codename**   | string |              |
| **$confName**   | string |              |
| **$configPath** | string |              |

##### Ошибки: [#ошибки-12]

| Тип               | Описание                                                                  |
| ----------------- | ------------------------------------------------------------------------- |
| \\JsonException    | Если возникают ошибки при кодировании JSON.                               |
| \\RuntimeException | Если не удается записать файл или выполнить операции с файловой системой. |
| \\Throwable        |                                                                           |

##### Возвращает: [#возвращает-21]

\`\`\`
array
\`\`\`

Вернет массив настроек, извлеченных из старого конфигурационного файла.
`,o={contents:[{heading:`краткое-содержание`,content:`Абстрактный класс DataManager, представляющий базовый функционал для менеджеров данных.`},{heading:`описание`,content:`Класс служит основой для реализации логики работы с данными, например, взаимодействия с базой данных.
Конкретные реализации должны быть определены в наследниках этого класса.`},{heading:`свойства`,content:`protected $db`},{heading:`методы`,content:`public abbr()`},{heading:`методы`,content:`public connect()`},{heading:`методы`,content:`public createDir()`},{heading:`методы`,content:`public createLockFile()`},{heading:`методы`,content:`public defType()`},{heading:`методы`,content:`public deleteDir()`},{heading:`методы`,content:`public dirToArray()`},{heading:`методы`,content:`public getComparer()`},{heading:`методы`,content:`public getConfig()`},{heading:`методы`,content:`public getDb()`},{heading:`методы`,content:`public getPrefix()`},{heading:`методы`,content:`public getUserPrefix()`},{heading:`методы`,content:`public joinPaths()`},{heading:`методы`,content:`public nameArgs() - (deprecated)`},{heading:`методы`,content:`public normalizePath()`},{heading:`методы`,content:`public normalizeUrl()`},{heading:`методы`,content:`public sanitizeArrayInput()`},{heading:`методы`,content:`public sanitizeInput()`},{heading:`методы`,content:`public setDb()`},{heading:`методы`,content:`public toTranslit()`},{heading:`методы`,content:`private loadJsonConfig()`},{heading:`методы`,content:`private migrateOldConfig()`},{heading:`подробности`,content:`Путь: engine/inc/maharder/\\_includes/classes/DataManager.php`},{heading:`protected-db--db`,content:`**Краткое содержание**`},{heading:`protected-db--db`,content:`Статическое свойство для хранения экземпляра базы данных.`},{heading:`protected-db--db`,content:`**Тип:** db
Экземпляр базы данных или null, если он не инициализирован.`},{heading:`краткое-содержание-1`,content:`Создает аббревиатуру из переданной строки, используя указанное разделение слов.`},{heading:`описание-1`,content:`Функция извлекает первую букву каждого слова из строки, разделенной указанным
разделителем, и формирует из них аббревиатуру, преобразуя результат в верхний регистр.`},{heading:`свойства-2`,content:`Название`},{heading:`свойства-2`,content:`Тип`},{heading:`свойства-2`,content:`По умолчанию`},{heading:`свойства-2`,content:`**$string**`},{heading:`свойства-2`,content:`string`},{heading:`свойства-2`,content:`**$sep**`},{heading:`свойства-2`,content:`string`},{heading:`свойства-2`,content:`'\\_'`},{heading:`ошибки`,content:`Тип`},{heading:`ошибки`,content:`Описание`},{heading:`ошибки`,content:`\\InvalidArgumentException`},{heading:`ошибки`,content:`Если один из параметров передан с некорректным типом.`},{heading:`возвращает`,content:`Аббревиатура, сформированная из начальных букв всех слов строки в верхнем регистре.`},{heading:`краткое-содержание-2`,content:`Устанавливает подключение к базе данных, если оно еще не было установлено.`},{heading:`описание-2`,content:"Если глобальная переменная `DBHOST` не определена, подключение\nк базе данных конфигурируется через файл `dbconfig.php` в папке ENGINE\\_DIR.\nВ противном случае используется глобальная переменная `$db`."},{heading:`смотри-так-же-1`,content:`\\DataManager::setDb()`},{heading:`краткое-содержание-3`,content:`Создаёт папку(и) по указанным путям с заданными правами доступа.`},{heading:`описание-3`,content:`Для каждого предоставленного пути создаётся директория, если она ещё не существует.
При возникновении ошибки (например, неудачного создания директории)
ошибка логируется через \`LogGenerator::generate_log\`.`},{heading:`свойства-3`,content:`Название`},{heading:`свойства-3`,content:`Тип`},{heading:`свойства-3`,content:`По умолчанию`},{heading:`свойства-3`,content:`**$service**`},{heading:`свойства-3`,content:`string`},{heading:`свойства-3`,content:`'DataManager'`},{heading:`свойства-3`,content:`**$module**`},{heading:`свойства-3`,content:`string`},{heading:`свойства-3`,content:`'mhadmin'`},{heading:`свойства-3`,content:`**$permission**`},{heading:`свойства-3`,content:`int`},{heading:`свойства-3`,content:`0755`},{heading:`свойства-3`,content:`**$paths**`},{heading:`свойства-3`,content:`string`},{heading:`ошибки-1`,content:`Тип`},{heading:`ошибки-1`,content:`Описание`},{heading:`ошибки-1`,content:`\\RuntimeException`},{heading:`ошибки-1`,content:`Бросается, если директория не может быть создана.`},{heading:`ошибки-1`,content:`\\JsonException\\|\\Throwable`},{heading:`ошибки-1`,content:`Может быть вызван, если ошибка логирования связана с кодировкой JSON.`},{heading:`возвращает-2`,content:"Возвращает `true`, если все директории успешно созданы, иначе `false`."},{heading:`свойства-4`,content:`Название`},{heading:`свойства-4`,content:`Тип`},{heading:`свойства-4`,content:`По умолчанию`},{heading:`свойства-4`,content:`**$path**`},{heading:`свойства-4`,content:`string`},{heading:`ошибки-2`,content:`Тип`},{heading:`ошибки-2`,content:`Описание`},{heading:`ошибки-2`,content:`\\Throwable`},{heading:`ошибки-2`,content:`\\JsonException`},{heading:`краткое-содержание-4`,content:`Приводит значение к указанному типу, если возможно, используя набор фильтров.`},{heading:`описание-4`,content:`Функция принимает значение и тип, преобразует значение к заданному типу с использованием соответствующего
фильтра. Если преобразование невозможно, возвращается строковое представление значения.`},{heading:`описание-4`,content:`Поддерживаемые типы:`},{heading:`описание-4`,content:"`double`, `float`: преобразование в число с плавающей точкой."},{heading:`описание-4`,content:"`boolean`, `bool`: преобразование в булево значение."},{heading:`описание-4`,content:"`integer`, `int`, `tinyint`: преобразование в целое число."},{heading:`описание-4`,content:"`string`: фильтрация как строка."},{heading:`описание-4`,content:`Если указанный тип отсутствует в карте типов, функция возвращает строковое представление значения.`},{heading:`свойства-5`,content:`Название`},{heading:`свойства-5`,content:`Тип`},{heading:`свойства-5`,content:`По умолчанию`},{heading:`свойства-5`,content:`**$value**`},{heading:`свойства-5`,content:`mixed`},{heading:`свойства-5`,content:`**$type**`},{heading:`свойства-5`,content:`string`},{heading:`ошибки-3`,content:`Тип`},{heading:`ошибки-3`,content:`Описание`},{heading:`ошибки-3`,content:`\\ValueError`},{heading:`ошибки-3`,content:"Исключение может быть выброшено, если `filter_var` получит некорректный фильтр."},{heading:`возвращает-4`,content:`Преобразованное значение в заданный тип, либо строковое представление значения,
если преобразование невозможно или тип неизвестен.`},{heading:`краткое-содержание-5`,content:`Полностью удаляет директорию и все её содержимое, включая файлы и вложенные директории.`},{heading:`описание-5`,content:`Эта функция рекурсивно обходит заданный путь, удаляя все файлы и вложенные директории,
а затем удаляет саму директорию. Игнорирует защищённую директорию,
путь к которой жёстко прописан в коде.`},{heading:`свойства-6`,content:`Название`},{heading:`свойства-6`,content:`Тип`},{heading:`свойства-6`,content:`По умолчанию`},{heading:`свойства-6`,content:`**$path**`},{heading:`свойства-6`,content:`string`},{heading:`ошибки-4`,content:`Тип`},{heading:`ошибки-4`,content:`Описание`},{heading:`ошибки-4`,content:`\\UnexpectedValueException`},{heading:`ошибки-4`,content:`В случае, если переданный путь не является директорией или не может быть прочитан.`},{heading:`краткое-содержание-6`,content:`Преобразует указанную директорию в массив, содержащий все папки и файлы из неё.`},{heading:`описание-6`,content:`Этот метод является обёрткой для функции \`dirToArray\` и вызывает её с переданными
параметрами. Используется для рекурсивного получения структуры директорий и файлов
в виде массива.`},{heading:`смотри-так-же-2`,content:`\\dirToArray()`},{heading:`свойства-7`,content:`Название`},{heading:`свойства-7`,content:`Тип`},{heading:`свойства-7`,content:`По умолчанию`},{heading:`свойства-7`,content:`**$dir**`},{heading:`свойства-7`,content:`string`},{heading:`свойства-7`,content:`**$\\_ext**`},{heading:`свойства-7`,content:`mixed`},{heading:`возвращает-6`,content:`Ассоциативный массив, где ключами могут быть директории, а значения —
содержимое этих директорий; файлы представлены в виде элементов массива.`},{heading:`краткое-содержание-7`,content:`Формирует строку, представляющую оператор сравнения и значение, основанную на переданном значении.`},{heading:`описание-7`,content:`Эта функция анализирует начальный символ переданного значения, чтобы определить оператор сравнения
(например, '=', '\\<', '>', 'LIKE', '\\<>', '\\<=',
'>='). Если переданный оператор — '%', то значение
оборачивается в проценты для использования в операциях LIKE. Если значение начинается с других
специальных символов, оно интерпретируется и оператор определяется автоматически.
При необходимости значение преобразуется в указанный тип.`},{heading:`свойства-8`,content:`Название`},{heading:`свойства-8`,content:`Тип`},{heading:`свойства-8`,content:`По умолчанию`},{heading:`свойства-8`,content:`**$value**`},{heading:`свойства-8`,content:`mixed`},{heading:`ошибки-5`,content:`Тип`},{heading:`ошибки-5`,content:`Описание`},{heading:`ошибки-5`,content:`\\InvalidArgumentException`},{heading:`ошибки-5`,content:`Если передано некорректное значение или тип недопустим для обработки.`},{heading:`возвращает-7`,content:`Строка, представляющая оператор сравнения и значение, готовая для использования
в SQL- или других выражениях. Например: " = 'some\\_value'", "\\< 10", или " LIKE
'%abc%'".`},{heading:`краткое-содержание-8`,content:`Получает конфигурацию на основе указанного кода имени и пути к файлу JSON.`},{heading:`описание-8`,content:`Метод сначала пытается загрузить конфигурацию из указанного или стандартного пути.
Если файл не найден, он проверяет, указано ли устаревшее имя конфигурации
для выполнения миграции данных. Если миграция невозможна, возвращается пустой массив.`},{heading:`свойства-9`,content:`Название`},{heading:`свойства-9`,content:`Тип`},{heading:`свойства-9`,content:`По умолчанию`},{heading:`свойства-9`,content:`**$codename**`},{heading:`свойства-9`,content:`string`},{heading:`свойства-9`,content:`**$path**`},{heading:`свойства-9`,content:`string\\|null`},{heading:`свойства-9`,content:`null`},{heading:`свойства-9`,content:`**$confName**`},{heading:`свойства-9`,content:`string\\|null`},{heading:`свойства-9`,content:`null`},{heading:`ошибки-6`,content:`Тип`},{heading:`ошибки-6`,content:`Описание`},{heading:`ошибки-6`,content:`\\JsonException`},{heading:`ошибки-6`,content:"Если содержимое JSON-файла некорректно при вызове `loadJsonConfig`."},{heading:`ошибки-6`,content:`\\RuntimeException`},{heading:`ошибки-6`,content:`Если ошибка возникает во время миграции конфигурации.`},{heading:`возвращает-8`,content:`Возвращает массив конфигурации. Если файл или миграция недоступны, возвращается пустой массив.`},{heading:`краткое-содержание-9`,content:`Возвращает объект подключения к базе данных.`},{heading:`описание-9`,content:`Если подключение еще не было установлено, метод инициирует его вызовом метода connect().`},{heading:`смотри-так-же-3`,content:`\\DataManager:connect()`},{heading:`смотри-так-же-3`,content:`\\DataManager::$db`},{heading:`возвращает-9`,content:`Объект подключения к базе данных.`},{heading:`краткое-содержание-10`,content:`Возвращает префикс, заданный в системе.`},{heading:`возвращает-10`,content:`Префикс, используемый в системе.`},{heading:`краткое-содержание-11`,content:`Получает префикс пользователя.`},{heading:`описание-10`,content:"Данный метод возвращает значение константы `USERPREFIX`."},{heading:`возвращает-11`,content:`Префикс пользователя.`},{heading:`краткое-содержание-12`,content:`Объединяет несколько путей в один.`},{heading:`описание-11`,content:`Объединение происходит слева направо. Пустые значения игнорируются.
Возвращаемый путь нормализуется (лишние символы удаляются, контролируется корректность пути).`},{heading:`свойства-10`,content:`Название`},{heading:`свойства-10`,content:`Тип`},{heading:`свойства-10`,content:`По умолчанию`},{heading:`свойства-10`,content:`**$paths**`},{heading:`свойства-10`,content:`string`},{heading:`ошибки-7`,content:`Тип`},{heading:`ошибки-7`,content:`Описание`},{heading:`ошибки-7`,content:`\\RuntimeException`},{heading:`ошибки-7`,content:`Если произошла ошибка при нормализации пути.`},{heading:`возвращает-12`,content:`Возвращает объединённый и нормализованный путь.`},{heading:`краткое-содержание-13`,content:`Преобразует переданный массив в плоский массив ключ-значение, удаляя пустые значения.`},{heading:`описание-12`,content:`Метод принимает массив (или null) и возвращает новый массив,
где все вложенные массивы разворачиваются в плоскую структуру.
Для элементов с числовыми ключами их значения назначаются в виде ключей и значений одновременно.
Пустые строки или \`null\` удаляются из итогового массива.`},{heading:`описание-12`,content:`**Устарело**
Устарело с версии PHP 8.1. Рекомендуется использовать альтернативные методы для работы с массивами.`},{heading:`свойства-11`,content:`Название`},{heading:`свойства-11`,content:`Тип`},{heading:`свойства-11`,content:`По умолчанию`},{heading:`свойства-11`,content:`**$args**`},{heading:`свойства-11`,content:`array\\|null`},{heading:`ошибки-8`,content:`Тип`},{heading:`ошибки-8`,content:`Описание`},{heading:`ошибки-8`,content:`\\InvalidArgumentException`},{heading:`ошибки-8`,content:`Если аргумент $args содержит некорректные данные.`},{heading:`возвращает-13`,content:"Плоский массив ключ-значение, где пустые строки и `null` исключены."},{heading:`краткое-содержание-14`,content:`Нормализует путь, очищая его от лишних управляющих символов, точек и других нежелательных элементов.`},{heading:`описание-13`,content:`Эта функция:`},{heading:`описание-13`,content:"Удаляет управляющие символы и преобразует все обратные слэши (`\\`) в прямые (`/`)."},{heading:`описание-13`,content:"Убирает текущую (`.`) и родительскую (`..`) директории из пути."},{heading:`описание-13`,content:`Удаляет корневой каталог (ROOT\\_DIR), если путь начинается с него.`},{heading:`описание-13`,content:"Гарантирует, что путь на Linux начинается с символа `/`."},{heading:`свойства-12`,content:`Название`},{heading:`свойства-12`,content:`Тип`},{heading:`свойства-12`,content:`По умолчанию`},{heading:`свойства-12`,content:`**$path**`},{heading:`свойства-12`,content:`string`},{heading:`ошибки-9`,content:`Тип`},{heading:`ошибки-9`,content:`Описание`},{heading:`ошибки-9`,content:`\\InvalidArgumentException`},{heading:`ошибки-9`,content:`Если константа ROOT\\_DIR не определена или имеет недопустимый тип.`},{heading:`возвращает-14`,content:`Нормализованный путь.
Возвращается пустая строка, если входной путь содержит недопустимые символы (например, управляющие символы).`},{heading:`краткое-содержание-15`,content:`Нормализует указанный URL, добавляя дополнительные параметры запроса при необходимости.`},{heading:`описание-14`,content:`Если URL содержит схему или начинается с двойного слэша, возвращается исходный URL без изменений.
Если URL не содержит схему, добавляется базовый URL, который формируется на основе конфигурации \`$config\`.
Если путь в URL является относительным, он также дополняется базовым URL.`},{heading:`свойства-13`,content:`Название`},{heading:`свойства-13`,content:`Тип`},{heading:`свойства-13`,content:`По умолчанию`},{heading:`свойства-13`,content:`**$url**`},{heading:`свойства-13`,content:`string`},{heading:`свойства-13`,content:`**$additionalQuery**`},{heading:`свойства-13`,content:`array`},{heading:`свойства-13`,content:`\\[]`},{heading:`возвращает-15`,content:`Нормализованный URL.`},{heading:`краткое-содержание-16`,content:`Очищает входные данные, массивы или значения, используя заданные флаги для фильтрации.`},{heading:`описание-15`,content:`Если входные данные являются массивом, рекурсивно применяется функция очистки ко всем элементам массива.
Если входные данные - одно значение, применяется очистка непосредственно к нему.`},{heading:`свойства-14`,content:`Название`},{heading:`свойства-14`,content:`Тип`},{heading:`свойства-14`,content:`По умолчанию`},{heading:`свойства-14`,content:`**$input**`},{heading:`свойства-14`,content:`mixed`},{heading:`свойства-14`,content:`null`},{heading:`свойства-14`,content:`**$flags**`},{heading:`свойства-14`,content:`array\\|null`},{heading:`свойства-14`,content:`null`},{heading:`возвращает-16`,content:`Очищенные данные. Если входные данные - массив, возвращается очищенный массив. Если данные не
заданы, возвращается null.`},{heading:`краткое-содержание-17`,content:`Обрабатывает и фильтрует входящее значение на основе заданных флагов.`},{heading:`описание-16`,content:"Эта функция принимает значение и массив флагов фильтрации, которые применяются\nк значению последовательно, используя функцию `filter_var`."},{heading:`свойства-15`,content:`Название`},{heading:`свойства-15`,content:`Тип`},{heading:`свойства-15`,content:`По умолчанию`},{heading:`свойства-15`,content:`**$value**`},{heading:`свойства-15`,content:`mixed\\|null`},{heading:`свойства-15`,content:`null`},{heading:`свойства-15`,content:`**$flags**`},{heading:`свойства-15`,content:`array\\|null`},{heading:`свойства-15`,content:`null`},{heading:`возвращает-17`,content:"Возвращает отфильтрованное значение в виде строки или `null` в случае, если\nзначение или фильтрация недействительны."},{heading:`краткое-содержание-18`,content:`Устанавливает экземпляр базы данных.`},{heading:`описание-17`,content:`Метод задает объект базы данных, который будет использоваться в дальнейшем.`},{heading:`смотри-так-же-4`,content:`\\DataManager::$db`},{heading:`свойства-16`,content:`Название`},{heading:`свойства-16`,content:`Тип`},{heading:`свойства-16`,content:`По умолчанию`},{heading:`свойства-16`,content:`**$db**`},{heading:`свойства-16`,content:`\\db\\|null`},{heading:`краткое-содержание-19`,content:`Конвертирует строку в транслитерацию, форматирует её и удаляет нежелательные символы.`},{heading:`описание-18`,content:`Эта функция выполняет трансформацию текста с учетом заданного функционала:`},{heading:`описание-18`,content:"Преобразует строку в транслит с использованием Transliterator или функции `totranslit()`,\nесли Transliterator недоступен."},{heading:`описание-18`,content:`Удаляет все символы, кроме букв, цифр и пробелов.`},{heading:`описание-18`,content:`Заменяет пробелы на символы подчеркивания.`},{heading:`описание-18`,content:`Приводит строку к нижнему регистру.`},{heading:`описание-18`,content:`Функция упрощает создание URL-совместимых или SEO-оптимизированных строк из произвольных
текстовых данных.`},{heading:`свойства-17`,content:`Название`},{heading:`свойства-17`,content:`Тип`},{heading:`свойства-17`,content:`По умолчанию`},{heading:`свойства-17`,content:`**$input**`},{heading:`свойства-17`,content:`string`},{heading:`свойства-17`,content:`**$lowercase**`},{heading:`свойства-17`,content:`bool`},{heading:`свойства-17`,content:`true`},{heading:`ошибки-10`,content:`Тип`},{heading:`ошибки-10`,content:`Описание`},{heading:`ошибки-10`,content:`\\RuntimeException`},{heading:`ошибки-10`,content:`Если ни один из механизмов транслитерации, Transliterator или totranslit, недоступен или некорректен.`},{heading:`возвращает-19`,content:`Отформатированная строка, приведенная к нижнему регистру, состоящая из
символов латиницы, цифр и подчеркиваний.`},{heading:`краткое-содержание-20`,content:`Загружает JSON-конфигурацию из указанного файла и возвращает её в виде массива.`},{heading:`описание-19`,content:`Функция читает содержимое файла, парсит его как JSON и возвращает массив данных.
Если элементы данных не являются массивами, они проходят фильтрацию с использованием
\`FILTER_SANITIZE_FULL_SPECIAL_CHARS\`.`},{heading:`свойства-18`,content:`Название`},{heading:`свойства-18`,content:`Тип`},{heading:`свойства-18`,content:`По умолчанию`},{heading:`свойства-18`,content:`**$filePath**`},{heading:`свойства-18`,content:`string`},{heading:`ошибки-11`,content:`Тип`},{heading:`ошибки-11`,content:`Описание`},{heading:`ошибки-11`,content:`\\JsonException`},{heading:`ошибки-11`,content:`Если произошла ошибка при парсинге JSON.`},{heading:`ошибки-11`,content:`\\RuntimeException`},{heading:`ошибки-11`,content:`Если файл не существует или недоступен для чтения.`},{heading:`возвращает-20`,content:`Ассоциативный массив, содержащий данные из файла JSON.`},{heading:`краткое-содержание-21`,content:`Мигрирует старый файл конфигурации в новый JSON-формат.`},{heading:`описание-20`,content:`Функция проверяет наличие старого конфигурационного файла, преобразует его
содержимое в новый формат, сохраняет в указанной директории в формате JSON и
удаляет старый файл. Если файл отсутствует или содержит некорректный формат данных,
выполняются соответствующие обработки ошибок и возвращается пустой массив.`},{heading:`смотри-так-же-5`,content:`\\LogGenerator::generateLog()`},{heading:`свойства-19`,content:`Название`},{heading:`свойства-19`,content:`Тип`},{heading:`свойства-19`,content:`По умолчанию`},{heading:`свойства-19`,content:`**$codename**`},{heading:`свойства-19`,content:`string`},{heading:`свойства-19`,content:`**$confName**`},{heading:`свойства-19`,content:`string`},{heading:`свойства-19`,content:`**$configPath**`},{heading:`свойства-19`,content:`string`},{heading:`ошибки-12`,content:`Тип`},{heading:`ошибки-12`,content:`Описание`},{heading:`ошибки-12`,content:`\\JsonException`},{heading:`ошибки-12`,content:`Если возникают ошибки при кодировании JSON.`},{heading:`ошибки-12`,content:`\\RuntimeException`},{heading:`ошибки-12`,content:`Если не удается записать файл или выполнить операции с файловой системой.`},{heading:`ошибки-12`,content:`\\Throwable`},{heading:`возвращает-21`,content:`Вернет массив настроек, извлеченных из старого конфигурационного файла.`}],headings:[{id:`краткое-содержание`,content:`Краткое содержание:`},{id:`описание`,content:`Описание:`},{id:`свойства`,content:`Свойства`},{id:`методы`,content:`Методы`},{id:`подробности`,content:`Подробности`},{id:`свойства-1`,content:`Свойства`},{id:`protected-db--db`,content:`protected $db : ?\\db`},{id:`методы-1`,content:`Методы`},{id:`abbr`,content:`abbr`},{id:`краткое-содержание-1`,content:`Краткое содержание`},{id:`описание-1`,content:`Описание`},{id:`смотри-так-же`,content:`Смотри так-же:`},{id:`свойства-2`,content:`Свойства:`},{id:`ошибки`,content:`Ошибки:`},{id:`возвращает`,content:`Возвращает:`},{id:`connect`,content:`connect`},{id:`краткое-содержание-2`,content:`Краткое содержание`},{id:`описание-2`,content:`Описание`},{id:`смотри-так-же-1`,content:`Смотри так-же:`},{id:`возвращает-1`,content:`Возвращает:`},{id:`createdir`,content:`createDir`},{id:`краткое-содержание-3`,content:`Краткое содержание`},{id:`описание-3`,content:`Описание`},{id:`свойства-3`,content:`Свойства:`},{id:`ошибки-1`,content:`Ошибки:`},{id:`возвращает-2`,content:`Возвращает:`},{id:`createlockfile`,content:`createLockFile`},{id:`свойства-4`,content:`Свойства:`},{id:`ошибки-2`,content:`Ошибки:`},{id:`возвращает-3`,content:`Возвращает:`},{id:`deftype`,content:`defType`},{id:`краткое-содержание-4`,content:`Краткое содержание`},{id:`описание-4`,content:`Описание`},{id:`свойства-5`,content:`Свойства:`},{id:`ошибки-3`,content:`Ошибки:`},{id:`возвращает-4`,content:`Возвращает:`},{id:`deletedir`,content:`deleteDir`},{id:`краткое-содержание-5`,content:`Краткое содержание`},{id:`описание-5`,content:`Описание`},{id:`свойства-6`,content:`Свойства:`},{id:`ошибки-4`,content:`Ошибки:`},{id:`возвращает-5`,content:`Возвращает:`},{id:`dirtoarray`,content:`dirToArray`},{id:`краткое-содержание-6`,content:`Краткое содержание`},{id:`описание-6`,content:`Описание`},{id:`смотри-так-же-2`,content:`Смотри так-же:`},{id:`свойства-7`,content:`Свойства:`},{id:`возвращает-6`,content:`Возвращает:`},{id:`getcomparer`,content:`getComparer`},{id:`краткое-содержание-7`,content:`Краткое содержание`},{id:`описание-7`,content:`Описание`},{id:`свойства-8`,content:`Свойства:`},{id:`ошибки-5`,content:`Ошибки:`},{id:`возвращает-7`,content:`Возвращает:`},{id:`getconfig`,content:`getConfig`},{id:`краткое-содержание-8`,content:`Краткое содержание`},{id:`описание-8`,content:`Описание`},{id:`свойства-9`,content:`Свойства:`},{id:`ошибки-6`,content:`Ошибки:`},{id:`возвращает-8`,content:`Возвращает:`},{id:`getdb`,content:`getDb`},{id:`краткое-содержание-9`,content:`Краткое содержание`},{id:`описание-9`,content:`Описание`},{id:`смотри-так-же-3`,content:`Смотри так-же:`},{id:`возвращает-9`,content:`Возвращает:`},{id:`getprefix`,content:`getPrefix`},{id:`краткое-содержание-10`,content:`Краткое содержание`},{id:`возвращает-10`,content:`Возвращает:`},{id:`getuserprefix`,content:`getUserPrefix`},{id:`краткое-содержание-11`,content:`Краткое содержание`},{id:`описание-10`,content:`Описание`},{id:`возвращает-11`,content:`Возвращает:`},{id:`joinpaths`,content:`joinPaths`},{id:`краткое-содержание-12`,content:`Краткое содержание`},{id:`описание-11`,content:`Описание`},{id:`свойства-10`,content:`Свойства:`},{id:`ошибки-7`,content:`Ошибки:`},{id:`возвращает-12`,content:`Возвращает:`},{id:`nameargs`,content:`nameArgs`},{id:`краткое-содержание-13`,content:`Краткое содержание`},{id:`описание-12`,content:`Описание`},{id:`свойства-11`,content:`Свойства:`},{id:`ошибки-8`,content:`Ошибки:`},{id:`возвращает-13`,content:`Возвращает:`},{id:`normalizepath`,content:`normalizePath`},{id:`краткое-содержание-14`,content:`Краткое содержание`},{id:`описание-13`,content:`Описание`},{id:`свойства-12`,content:`Свойства:`},{id:`ошибки-9`,content:`Ошибки:`},{id:`возвращает-14`,content:`Возвращает:`},{id:`normalizeurl`,content:`normalizeUrl`},{id:`краткое-содержание-15`,content:`Краткое содержание`},{id:`описание-14`,content:`Описание`},{id:`свойства-13`,content:`Свойства:`},{id:`возвращает-15`,content:`Возвращает:`},{id:`sanitizearrayinput`,content:`sanitizeArrayInput`},{id:`краткое-содержание-16`,content:`Краткое содержание`},{id:`описание-15`,content:`Описание`},{id:`свойства-14`,content:`Свойства:`},{id:`возвращает-16`,content:`Возвращает:`},{id:`sanitizeinput`,content:`sanitizeInput`},{id:`краткое-содержание-17`,content:`Краткое содержание`},{id:`описание-16`,content:`Описание`},{id:`свойства-15`,content:`Свойства:`},{id:`возвращает-17`,content:`Возвращает:`},{id:`setdb`,content:`setDb`},{id:`краткое-содержание-18`,content:`Краткое содержание`},{id:`описание-17`,content:`Описание`},{id:`смотри-так-же-4`,content:`Смотри так-же:`},{id:`свойства-16`,content:`Свойства:`},{id:`возвращает-18`,content:`Возвращает:`},{id:`totranslit`,content:`toTranslit`},{id:`краткое-содержание-19`,content:`Краткое содержание`},{id:`описание-18`,content:`Описание`},{id:`свойства-17`,content:`Свойства:`},{id:`ошибки-10`,content:`Ошибки:`},{id:`возвращает-19`,content:`Возвращает:`},{id:`loadjsonconfig`,content:`loadJsonConfig`},{id:`краткое-содержание-20`,content:`Краткое содержание`},{id:`описание-19`,content:`Описание`},{id:`свойства-18`,content:`Свойства:`},{id:`ошибки-11`,content:`Ошибки:`},{id:`возвращает-20`,content:`Возвращает:`},{id:`migrateoldconfig`,content:`migrateOldConfig`},{id:`краткое-содержание-21`,content:`Краткое содержание`},{id:`описание-20`,content:`Описание`},{id:`смотри-так-же-5`,content:`Смотри так-же:`},{id:`свойства-19`,content:`Свойства:`},{id:`ошибки-12`,content:`Ошибки:`},{id:`возвращает-21`,content:`Возвращает:`}]},s=[{depth:2,url:`#краткое-содержание`,title:(0,n.jsx)(n.Fragment,{children:`Краткое содержание:`})},{depth:2,url:`#описание`,title:(0,n.jsx)(n.Fragment,{children:`Описание:`})},{depth:3,url:`#свойства`,title:(0,n.jsx)(n.Fragment,{children:`Свойства`})},{depth:3,url:`#методы`,title:(0,n.jsx)(n.Fragment,{children:`Методы`})},{depth:3,url:`#подробности`,title:(0,n.jsx)(n.Fragment,{children:`Подробности`})},{depth:2,url:`#свойства-1`,title:(0,n.jsx)(n.Fragment,{children:`Свойства`})},{depth:4,url:`#protected-db--db`,title:(0,n.jsx)(n.Fragment,{children:`protected $db : ?\\db`})},{depth:2,url:`#методы-1`,title:(0,n.jsx)(n.Fragment,{children:`Методы`})},{depth:3,url:`#abbr`,title:(0,n.jsx)(n.Fragment,{children:`abbr`})},{depth:5,url:`#краткое-содержание-1`,title:(0,n.jsx)(n.Fragment,{children:`Краткое содержание`})},{depth:5,url:`#описание-1`,title:(0,n.jsx)(n.Fragment,{children:`Описание`})},{depth:5,url:`#смотри-так-же`,title:(0,n.jsx)(n.Fragment,{children:`Смотри так-же:`})},{depth:5,url:`#свойства-2`,title:(0,n.jsx)(n.Fragment,{children:`Свойства:`})},{depth:5,url:`#ошибки`,title:(0,n.jsx)(n.Fragment,{children:`Ошибки:`})},{depth:5,url:`#возвращает`,title:(0,n.jsx)(n.Fragment,{children:`Возвращает:`})},{depth:3,url:`#connect`,title:(0,n.jsx)(n.Fragment,{children:`connect`})},{depth:5,url:`#краткое-содержание-2`,title:(0,n.jsx)(n.Fragment,{children:`Краткое содержание`})},{depth:5,url:`#описание-2`,title:(0,n.jsx)(n.Fragment,{children:`Описание`})},{depth:5,url:`#смотри-так-же-1`,title:(0,n.jsx)(n.Fragment,{children:`Смотри так-же:`})},{depth:5,url:`#возвращает-1`,title:(0,n.jsx)(n.Fragment,{children:`Возвращает:`})},{depth:3,url:`#createdir`,title:(0,n.jsx)(n.Fragment,{children:`createDir`})},{depth:5,url:`#краткое-содержание-3`,title:(0,n.jsx)(n.Fragment,{children:`Краткое содержание`})},{depth:5,url:`#описание-3`,title:(0,n.jsx)(n.Fragment,{children:`Описание`})},{depth:5,url:`#свойства-3`,title:(0,n.jsx)(n.Fragment,{children:`Свойства:`})},{depth:5,url:`#ошибки-1`,title:(0,n.jsx)(n.Fragment,{children:`Ошибки:`})},{depth:5,url:`#возвращает-2`,title:(0,n.jsx)(n.Fragment,{children:`Возвращает:`})},{depth:3,url:`#createlockfile`,title:(0,n.jsx)(n.Fragment,{children:`createLockFile`})},{depth:5,url:`#свойства-4`,title:(0,n.jsx)(n.Fragment,{children:`Свойства:`})},{depth:5,url:`#ошибки-2`,title:(0,n.jsx)(n.Fragment,{children:`Ошибки:`})},{depth:5,url:`#возвращает-3`,title:(0,n.jsx)(n.Fragment,{children:`Возвращает:`})},{depth:3,url:`#deftype`,title:(0,n.jsx)(n.Fragment,{children:`defType`})},{depth:5,url:`#краткое-содержание-4`,title:(0,n.jsx)(n.Fragment,{children:`Краткое содержание`})},{depth:5,url:`#описание-4`,title:(0,n.jsx)(n.Fragment,{children:`Описание`})},{depth:5,url:`#свойства-5`,title:(0,n.jsx)(n.Fragment,{children:`Свойства:`})},{depth:5,url:`#ошибки-3`,title:(0,n.jsx)(n.Fragment,{children:`Ошибки:`})},{depth:5,url:`#возвращает-4`,title:(0,n.jsx)(n.Fragment,{children:`Возвращает:`})},{depth:3,url:`#deletedir`,title:(0,n.jsx)(n.Fragment,{children:`deleteDir`})},{depth:5,url:`#краткое-содержание-5`,title:(0,n.jsx)(n.Fragment,{children:`Краткое содержание`})},{depth:5,url:`#описание-5`,title:(0,n.jsx)(n.Fragment,{children:`Описание`})},{depth:5,url:`#свойства-6`,title:(0,n.jsx)(n.Fragment,{children:`Свойства:`})},{depth:5,url:`#ошибки-4`,title:(0,n.jsx)(n.Fragment,{children:`Ошибки:`})},{depth:5,url:`#возвращает-5`,title:(0,n.jsx)(n.Fragment,{children:`Возвращает:`})},{depth:3,url:`#dirtoarray`,title:(0,n.jsx)(n.Fragment,{children:`dirToArray`})},{depth:5,url:`#краткое-содержание-6`,title:(0,n.jsx)(n.Fragment,{children:`Краткое содержание`})},{depth:5,url:`#описание-6`,title:(0,n.jsx)(n.Fragment,{children:`Описание`})},{depth:5,url:`#смотри-так-же-2`,title:(0,n.jsx)(n.Fragment,{children:`Смотри так-же:`})},{depth:5,url:`#свойства-7`,title:(0,n.jsx)(n.Fragment,{children:`Свойства:`})},{depth:5,url:`#возвращает-6`,title:(0,n.jsx)(n.Fragment,{children:`Возвращает:`})},{depth:3,url:`#getcomparer`,title:(0,n.jsx)(n.Fragment,{children:`getComparer`})},{depth:5,url:`#краткое-содержание-7`,title:(0,n.jsx)(n.Fragment,{children:`Краткое содержание`})},{depth:5,url:`#описание-7`,title:(0,n.jsx)(n.Fragment,{children:`Описание`})},{depth:5,url:`#свойства-8`,title:(0,n.jsx)(n.Fragment,{children:`Свойства:`})},{depth:5,url:`#ошибки-5`,title:(0,n.jsx)(n.Fragment,{children:`Ошибки:`})},{depth:5,url:`#возвращает-7`,title:(0,n.jsx)(n.Fragment,{children:`Возвращает:`})},{depth:3,url:`#getconfig`,title:(0,n.jsx)(n.Fragment,{children:`getConfig`})},{depth:5,url:`#краткое-содержание-8`,title:(0,n.jsx)(n.Fragment,{children:`Краткое содержание`})},{depth:5,url:`#описание-8`,title:(0,n.jsx)(n.Fragment,{children:`Описание`})},{depth:5,url:`#свойства-9`,title:(0,n.jsx)(n.Fragment,{children:`Свойства:`})},{depth:5,url:`#ошибки-6`,title:(0,n.jsx)(n.Fragment,{children:`Ошибки:`})},{depth:5,url:`#возвращает-8`,title:(0,n.jsx)(n.Fragment,{children:`Возвращает:`})},{depth:3,url:`#getdb`,title:(0,n.jsx)(n.Fragment,{children:`getDb`})},{depth:5,url:`#краткое-содержание-9`,title:(0,n.jsx)(n.Fragment,{children:`Краткое содержание`})},{depth:5,url:`#описание-9`,title:(0,n.jsx)(n.Fragment,{children:`Описание`})},{depth:5,url:`#смотри-так-же-3`,title:(0,n.jsx)(n.Fragment,{children:`Смотри так-же:`})},{depth:5,url:`#возвращает-9`,title:(0,n.jsx)(n.Fragment,{children:`Возвращает:`})},{depth:3,url:`#getprefix`,title:(0,n.jsx)(n.Fragment,{children:`getPrefix`})},{depth:5,url:`#краткое-содержание-10`,title:(0,n.jsx)(n.Fragment,{children:`Краткое содержание`})},{depth:5,url:`#возвращает-10`,title:(0,n.jsx)(n.Fragment,{children:`Возвращает:`})},{depth:3,url:`#getuserprefix`,title:(0,n.jsx)(n.Fragment,{children:`getUserPrefix`})},{depth:5,url:`#краткое-содержание-11`,title:(0,n.jsx)(n.Fragment,{children:`Краткое содержание`})},{depth:5,url:`#описание-10`,title:(0,n.jsx)(n.Fragment,{children:`Описание`})},{depth:5,url:`#возвращает-11`,title:(0,n.jsx)(n.Fragment,{children:`Возвращает:`})},{depth:3,url:`#joinpaths`,title:(0,n.jsx)(n.Fragment,{children:`joinPaths`})},{depth:5,url:`#краткое-содержание-12`,title:(0,n.jsx)(n.Fragment,{children:`Краткое содержание`})},{depth:5,url:`#описание-11`,title:(0,n.jsx)(n.Fragment,{children:`Описание`})},{depth:5,url:`#свойства-10`,title:(0,n.jsx)(n.Fragment,{children:`Свойства:`})},{depth:5,url:`#ошибки-7`,title:(0,n.jsx)(n.Fragment,{children:`Ошибки:`})},{depth:5,url:`#возвращает-12`,title:(0,n.jsx)(n.Fragment,{children:`Возвращает:`})},{depth:3,url:`#nameargs`,title:(0,n.jsx)(n.Fragment,{children:`nameArgs`})},{depth:5,url:`#краткое-содержание-13`,title:(0,n.jsx)(n.Fragment,{children:`Краткое содержание`})},{depth:5,url:`#описание-12`,title:(0,n.jsx)(n.Fragment,{children:`Описание`})},{depth:5,url:`#свойства-11`,title:(0,n.jsx)(n.Fragment,{children:`Свойства:`})},{depth:5,url:`#ошибки-8`,title:(0,n.jsx)(n.Fragment,{children:`Ошибки:`})},{depth:5,url:`#возвращает-13`,title:(0,n.jsx)(n.Fragment,{children:`Возвращает:`})},{depth:3,url:`#normalizepath`,title:(0,n.jsx)(n.Fragment,{children:`normalizePath`})},{depth:5,url:`#краткое-содержание-14`,title:(0,n.jsx)(n.Fragment,{children:`Краткое содержание`})},{depth:5,url:`#описание-13`,title:(0,n.jsx)(n.Fragment,{children:`Описание`})},{depth:5,url:`#свойства-12`,title:(0,n.jsx)(n.Fragment,{children:`Свойства:`})},{depth:5,url:`#ошибки-9`,title:(0,n.jsx)(n.Fragment,{children:`Ошибки:`})},{depth:5,url:`#возвращает-14`,title:(0,n.jsx)(n.Fragment,{children:`Возвращает:`})},{depth:3,url:`#normalizeurl`,title:(0,n.jsx)(n.Fragment,{children:`normalizeUrl`})},{depth:5,url:`#краткое-содержание-15`,title:(0,n.jsx)(n.Fragment,{children:`Краткое содержание`})},{depth:5,url:`#описание-14`,title:(0,n.jsx)(n.Fragment,{children:`Описание`})},{depth:5,url:`#свойства-13`,title:(0,n.jsx)(n.Fragment,{children:`Свойства:`})},{depth:5,url:`#возвращает-15`,title:(0,n.jsx)(n.Fragment,{children:`Возвращает:`})},{depth:3,url:`#sanitizearrayinput`,title:(0,n.jsx)(n.Fragment,{children:`sanitizeArrayInput`})},{depth:5,url:`#краткое-содержание-16`,title:(0,n.jsx)(n.Fragment,{children:`Краткое содержание`})},{depth:5,url:`#описание-15`,title:(0,n.jsx)(n.Fragment,{children:`Описание`})},{depth:5,url:`#свойства-14`,title:(0,n.jsx)(n.Fragment,{children:`Свойства:`})},{depth:5,url:`#возвращает-16`,title:(0,n.jsx)(n.Fragment,{children:`Возвращает:`})},{depth:3,url:`#sanitizeinput`,title:(0,n.jsx)(n.Fragment,{children:`sanitizeInput`})},{depth:5,url:`#краткое-содержание-17`,title:(0,n.jsx)(n.Fragment,{children:`Краткое содержание`})},{depth:5,url:`#описание-16`,title:(0,n.jsx)(n.Fragment,{children:`Описание`})},{depth:5,url:`#свойства-15`,title:(0,n.jsx)(n.Fragment,{children:`Свойства:`})},{depth:5,url:`#возвращает-17`,title:(0,n.jsx)(n.Fragment,{children:`Возвращает:`})},{depth:3,url:`#setdb`,title:(0,n.jsx)(n.Fragment,{children:`setDb`})},{depth:5,url:`#краткое-содержание-18`,title:(0,n.jsx)(n.Fragment,{children:`Краткое содержание`})},{depth:5,url:`#описание-17`,title:(0,n.jsx)(n.Fragment,{children:`Описание`})},{depth:5,url:`#смотри-так-же-4`,title:(0,n.jsx)(n.Fragment,{children:`Смотри так-же:`})},{depth:5,url:`#свойства-16`,title:(0,n.jsx)(n.Fragment,{children:`Свойства:`})},{depth:5,url:`#возвращает-18`,title:(0,n.jsx)(n.Fragment,{children:`Возвращает:`})},{depth:3,url:`#totranslit`,title:(0,n.jsx)(n.Fragment,{children:`toTranslit`})},{depth:5,url:`#краткое-содержание-19`,title:(0,n.jsx)(n.Fragment,{children:`Краткое содержание`})},{depth:5,url:`#описание-18`,title:(0,n.jsx)(n.Fragment,{children:`Описание`})},{depth:5,url:`#свойства-17`,title:(0,n.jsx)(n.Fragment,{children:`Свойства:`})},{depth:5,url:`#ошибки-10`,title:(0,n.jsx)(n.Fragment,{children:`Ошибки:`})},{depth:5,url:`#возвращает-19`,title:(0,n.jsx)(n.Fragment,{children:`Возвращает:`})},{depth:3,url:`#loadjsonconfig`,title:(0,n.jsx)(n.Fragment,{children:`loadJsonConfig`})},{depth:5,url:`#краткое-содержание-20`,title:(0,n.jsx)(n.Fragment,{children:`Краткое содержание`})},{depth:5,url:`#описание-19`,title:(0,n.jsx)(n.Fragment,{children:`Описание`})},{depth:5,url:`#свойства-18`,title:(0,n.jsx)(n.Fragment,{children:`Свойства:`})},{depth:5,url:`#ошибки-11`,title:(0,n.jsx)(n.Fragment,{children:`Ошибки:`})},{depth:5,url:`#возвращает-20`,title:(0,n.jsx)(n.Fragment,{children:`Возвращает:`})},{depth:3,url:`#migrateoldconfig`,title:(0,n.jsx)(n.Fragment,{children:`migrateOldConfig`})},{depth:5,url:`#краткое-содержание-21`,title:(0,n.jsx)(n.Fragment,{children:`Краткое содержание`})},{depth:5,url:`#описание-20`,title:(0,n.jsx)(n.Fragment,{children:`Описание`})},{depth:5,url:`#смотри-так-же-5`,title:(0,n.jsx)(n.Fragment,{children:`Смотри так-же:`})},{depth:5,url:`#свойства-19`,title:(0,n.jsx)(n.Fragment,{children:`Свойства:`})},{depth:5,url:`#ошибки-12`,title:(0,n.jsx)(n.Fragment,{children:`Ошибки:`})},{depth:5,url:`#возвращает-21`,title:(0,n.jsx)(n.Fragment,{children:`Возвращает:`})}];function c(e){let t={a:`a`,code:`code`,h2:`h2`,h3:`h3`,h4:`h4`,h5:`h5`,hr:`hr`,li:`li`,p:`p`,pre:`pre`,span:`span`,strong:`strong`,table:`table`,tbody:`tbody`,td:`td`,th:`th`,thead:`thead`,tr:`tr`,ul:`ul`,...e.components};return(0,n.jsxs)(n.Fragment,{children:[(0,n.jsx)(t.h2,{id:`краткое-содержание`,children:`Краткое содержание:`}),`
`,(0,n.jsx)(t.p,{children:`Абстрактный класс DataManager, представляющий базовый функционал для менеджеров данных.`}),`
`,(0,n.jsx)(t.h2,{id:`описание`,children:`Описание:`}),`
`,(0,n.jsx)(t.p,{children:`Класс служит основой для реализации логики работы с данными, например, взаимодействия с базой данных.
Конкретные реализации должны быть определены в наследниках этого класса.`}),`
`,(0,n.jsx)(t.hr,{}),`
`,(0,n.jsx)(t.h3,{id:`свойства`,children:`Свойства`}),`
`,(0,n.jsxs)(t.ul,{children:[`
`,(0,n.jsxs)(t.li,{children:[`protected $`,(0,n.jsx)(t.a,{href:`#property_db`,children:`db`})]}),`
`]}),`
`,(0,n.jsx)(t.hr,{}),`
`,(0,n.jsx)(t.h3,{id:`методы`,children:`Методы`}),`
`,(0,n.jsxs)(t.ul,{children:[`
`,(0,n.jsxs)(t.li,{children:[`public `,(0,n.jsx)(t.a,{href:`#method_abbr`,children:`abbr()`})]}),`
`,(0,n.jsxs)(t.li,{children:[`public `,(0,n.jsx)(t.a,{href:`#method_connect`,children:`connect()`})]}),`
`,(0,n.jsxs)(t.li,{children:[`public `,(0,n.jsx)(t.a,{href:`#method_createDir`,children:`createDir()`})]}),`
`,(0,n.jsxs)(t.li,{children:[`public `,(0,n.jsx)(t.a,{href:`#method_createLockFile`,children:`createLockFile()`})]}),`
`,(0,n.jsxs)(t.li,{children:[`public `,(0,n.jsx)(t.a,{href:`#method_defType`,children:`defType()`})]}),`
`,(0,n.jsxs)(t.li,{children:[`public `,(0,n.jsx)(t.a,{href:`#method_deleteDir`,children:`deleteDir()`})]}),`
`,(0,n.jsxs)(t.li,{children:[`public `,(0,n.jsx)(t.a,{href:`#method_dirToArray`,children:`dirToArray()`})]}),`
`,(0,n.jsxs)(t.li,{children:[`public `,(0,n.jsx)(t.a,{href:`#method_getComparer`,children:`getComparer()`})]}),`
`,(0,n.jsxs)(t.li,{children:[`public `,(0,n.jsx)(t.a,{href:`#method_getConfig`,children:`getConfig()`})]}),`
`,(0,n.jsxs)(t.li,{children:[`public `,(0,n.jsx)(t.a,{href:`#method_getDb`,children:`getDb()`})]}),`
`,(0,n.jsxs)(t.li,{children:[`public `,(0,n.jsx)(t.a,{href:`#method_getPrefix`,children:`getPrefix()`})]}),`
`,(0,n.jsxs)(t.li,{children:[`public `,(0,n.jsx)(t.a,{href:`#method_getUserPrefix`,children:`getUserPrefix()`})]}),`
`,(0,n.jsxs)(t.li,{children:[`public `,(0,n.jsx)(t.a,{href:`#method_joinPaths`,children:`joinPaths()`})]}),`
`,(0,n.jsxs)(t.li,{children:[`public `,(0,n.jsx)(t.a,{href:`#method_nameArgs`,children:`nameArgs()`}),` - (deprecated)`]}),`
`,(0,n.jsxs)(t.li,{children:[`public `,(0,n.jsx)(t.a,{href:`#method_normalizePath`,children:`normalizePath()`})]}),`
`,(0,n.jsxs)(t.li,{children:[`public `,(0,n.jsx)(t.a,{href:`#method_normalizeUrl`,children:`normalizeUrl()`})]}),`
`,(0,n.jsxs)(t.li,{children:[`public `,(0,n.jsx)(t.a,{href:`#method_sanitizeArrayInput`,children:`sanitizeArrayInput()`})]}),`
`,(0,n.jsxs)(t.li,{children:[`public `,(0,n.jsx)(t.a,{href:`#method_sanitizeInput`,children:`sanitizeInput()`})]}),`
`,(0,n.jsxs)(t.li,{children:[`public `,(0,n.jsx)(t.a,{href:`#method_setDb`,children:`setDb()`})]}),`
`,(0,n.jsxs)(t.li,{children:[`public `,(0,n.jsx)(t.a,{href:`#method_toTranslit`,children:`toTranslit()`})]}),`
`,(0,n.jsxs)(t.li,{children:[`private `,(0,n.jsx)(t.a,{href:`#method_loadJsonConfig`,children:`loadJsonConfig()`})]}),`
`,(0,n.jsxs)(t.li,{children:[`private `,(0,n.jsx)(t.a,{href:`#method_migrateOldConfig`,children:`migrateOldConfig()`})]}),`
`]}),`
`,(0,n.jsx)(t.hr,{}),`
`,(0,n.jsx)(t.h3,{id:`подробности`,children:`Подробности`}),`
`,(0,n.jsxs)(t.ul,{children:[`
`,(0,n.jsx)(t.li,{children:`Путь: engine/inc/maharder/_includes/classes/DataManager.php`}),`
`]}),`
`,(0,n.jsx)(t.hr,{}),`
`,(0,n.jsx)(t.h2,{id:`свойства-1`,children:`Свойства`}),`
`,(0,n.jsx)(`span`,{id:`property_db`}),`
`,(0,n.jsx)(t.h4,{id:`protected-db--db`,children:`protected $db : ?\\db`}),`
`,(0,n.jsx)(t.hr,{}),`
`,(0,n.jsx)(t.p,{children:(0,n.jsx)(t.strong,{children:`Краткое содержание`})}),`
`,(0,n.jsx)(t.p,{children:`Статическое свойство для хранения экземпляра базы данных.`}),`
`,(0,n.jsxs)(t.p,{children:[(0,n.jsx)(t.strong,{children:`Тип:`}),` `,(0,n.jsx)(`abbr`,{title:`?\\db`,children:`db`}),`
Экземпляр базы данных или null, если он не инициализирован.`]}),`
`,(0,n.jsx)(t.hr,{}),`
`,(0,n.jsx)(t.h2,{id:`методы-1`,children:`Методы`}),`
`,(0,n.jsx)(`span`,{id:`method_abbr`}),`
`,(0,n.jsx)(t.h3,{id:`abbr`,children:`abbr`}),`
`,(0,n.jsx)(n.Fragment,{children:(0,n.jsx)(t.pre,{className:`shiki shiki-themes github-light github-dark`,style:{"--shiki-light":`#24292e`,"--shiki-dark":`#e1e4e8`,"--shiki-light-bg":`#fff`,"--shiki-dark-bg":`#24292e`},tabIndex:`0`,icon:`<svg viewBox="0 0 24 24"><path d="M 6,1 C 4.354992,1 3,2.354992 3,4 v 16 c 0,1.645008 1.354992,3 3,3 h 12 c 1.645008,0 3,-1.354992 3,-3 V 8 7 A 1.0001,1.0001 0 0 0 20.707031,6.2929687 l -5,-5 A 1.0001,1.0001 0 0 0 15,1 h -1 z m 0,2 h 7 v 3 c 0,1.645008 1.354992,3 3,3 h 3 v 11 c 0,0.564129 -0.435871,1 -1,1 H 6 C 5.4358712,21 5,20.564129 5,20 V 4 C 5,3.4358712 5.4358712,3 6,3 Z M 15,3.4140625 18.585937,7 H 16 C 15.435871,7 15,6.5641288 15,6 Z" fill="currentColor" /></svg>`,children:(0,n.jsx)(t.code,{children:(0,n.jsx)(t.span,{className:`line`,children:(0,n.jsx)(t.span,{children:`static public abbr(string  string, string  sep = "_") : string`})})})})}),`
`,(0,n.jsx)(t.h5,{id:`краткое-содержание-1`,children:`Краткое содержание`}),`
`,(0,n.jsx)(t.p,{children:`Создает аббревиатуру из переданной строки, используя указанное разделение слов.`}),`
`,(0,n.jsx)(t.h5,{id:`описание-1`,children:`Описание`}),`
`,(0,n.jsx)(t.p,{children:`Функция извлекает первую букву каждого слова из строки, разделенной указанным
разделителем, и формирует из них аббревиатуру, преобразуя результат в верхний регистр.`}),`
`,(0,n.jsx)(t.h5,{id:`смотри-так-же`,children:`Смотри так-же:`}),`
`,(0,n.jsx)(t.h5,{id:`свойства-2`,children:`Свойства:`}),`
`,(0,n.jsxs)(t.table,{children:[(0,n.jsx)(t.thead,{children:(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.th,{children:`Название`}),(0,n.jsx)(t.th,{children:`Тип`}),(0,n.jsx)(t.th,{children:`По умолчанию`})]})}),(0,n.jsxs)(t.tbody,{children:[(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.td,{children:(0,n.jsx)(t.strong,{children:`$string`})}),(0,n.jsx)(t.td,{children:`string`}),(0,n.jsx)(t.td,{})]}),(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.td,{children:(0,n.jsx)(t.strong,{children:`$sep`})}),(0,n.jsx)(t.td,{children:`string`}),(0,n.jsx)(t.td,{children:`'_'`})]})]})]}),`
`,(0,n.jsx)(t.h5,{id:`ошибки`,children:`Ошибки:`}),`
`,(0,n.jsxs)(t.table,{children:[(0,n.jsx)(t.thead,{children:(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.th,{children:`Тип`}),(0,n.jsx)(t.th,{children:`Описание`})]})}),(0,n.jsx)(t.tbody,{children:(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.td,{children:`\\InvalidArgumentException`}),(0,n.jsx)(t.td,{children:`Если один из параметров передан с некорректным типом.`})]})})]}),`
`,(0,n.jsx)(t.h5,{id:`возвращает`,children:`Возвращает:`}),`
`,(0,n.jsx)(n.Fragment,{children:(0,n.jsx)(t.pre,{className:`shiki shiki-themes github-light github-dark`,style:{"--shiki-light":`#24292e`,"--shiki-dark":`#e1e4e8`,"--shiki-light-bg":`#fff`,"--shiki-dark-bg":`#24292e`},tabIndex:`0`,icon:`<svg viewBox="0 0 24 24"><path d="M 6,1 C 4.354992,1 3,2.354992 3,4 v 16 c 0,1.645008 1.354992,3 3,3 h 12 c 1.645008,0 3,-1.354992 3,-3 V 8 7 A 1.0001,1.0001 0 0 0 20.707031,6.2929687 l -5,-5 A 1.0001,1.0001 0 0 0 15,1 h -1 z m 0,2 h 7 v 3 c 0,1.645008 1.354992,3 3,3 h 3 v 11 c 0,0.564129 -0.435871,1 -1,1 H 6 C 5.4358712,21 5,20.564129 5,20 V 4 C 5,3.4358712 5.4358712,3 6,3 Z M 15,3.4140625 18.585937,7 H 16 C 15.435871,7 15,6.5641288 15,6 Z" fill="currentColor" /></svg>`,children:(0,n.jsx)(t.code,{children:(0,n.jsx)(t.span,{className:`line`,children:(0,n.jsx)(t.span,{children:`string`})})})})}),`
`,(0,n.jsx)(t.p,{children:`Аббревиатура, сформированная из начальных букв всех слов строки в верхнем регистре.`}),`
`,(0,n.jsx)(t.hr,{}),`
`,(0,n.jsx)(`span`,{id:`method_connect`}),`
`,(0,n.jsx)(t.h3,{id:`connect`,children:`connect`}),`
`,(0,n.jsx)(n.Fragment,{children:(0,n.jsx)(t.pre,{className:`shiki shiki-themes github-light github-dark`,style:{"--shiki-light":`#24292e`,"--shiki-dark":`#e1e4e8`,"--shiki-light-bg":`#fff`,"--shiki-dark-bg":`#24292e`},tabIndex:`0`,icon:`<svg viewBox="0 0 24 24"><path d="M 6,1 C 4.354992,1 3,2.354992 3,4 v 16 c 0,1.645008 1.354992,3 3,3 h 12 c 1.645008,0 3,-1.354992 3,-3 V 8 7 A 1.0001,1.0001 0 0 0 20.707031,6.2929687 l -5,-5 A 1.0001,1.0001 0 0 0 15,1 h -1 z m 0,2 h 7 v 3 c 0,1.645008 1.354992,3 3,3 h 3 v 11 c 0,0.564129 -0.435871,1 -1,1 H 6 C 5.4358712,21 5,20.564129 5,20 V 4 C 5,3.4358712 5.4358712,3 6,3 Z M 15,3.4140625 18.585937,7 H 16 C 15.435871,7 15,6.5641288 15,6 Z" fill="currentColor" /></svg>`,children:(0,n.jsx)(t.code,{children:(0,n.jsx)(t.span,{className:`line`,children:(0,n.jsx)(t.span,{children:`static public connect() : void`})})})})}),`
`,(0,n.jsx)(t.h5,{id:`краткое-содержание-2`,children:`Краткое содержание`}),`
`,(0,n.jsx)(t.p,{children:`Устанавливает подключение к базе данных, если оно еще не было установлено.`}),`
`,(0,n.jsx)(t.h5,{id:`описание-2`,children:`Описание`}),`
`,(0,n.jsxs)(t.p,{children:[`Если глобальная переменная `,(0,n.jsx)(t.code,{children:`DBHOST`}),` не определена, подключение
к базе данных конфигурируется через файл `,(0,n.jsx)(t.code,{children:`dbconfig.php`}),` в папке ENGINE_DIR.
В противном случае используется глобальная переменная `,(0,n.jsx)(t.code,{children:`$db`}),`.`]}),`
`,(0,n.jsx)(t.h5,{id:`смотри-так-же-1`,children:`Смотри так-же:`}),`
`,(0,n.jsxs)(t.ul,{children:[`
`,(0,n.jsx)(t.li,{children:(0,n.jsx)(t.a,{href:`#method_setDb`,children:`\\DataManager::setDb()`})}),`
`]}),`
`,(0,n.jsx)(t.h5,{id:`возвращает-1`,children:`Возвращает:`}),`
`,(0,n.jsx)(n.Fragment,{children:(0,n.jsx)(t.pre,{className:`shiki shiki-themes github-light github-dark`,style:{"--shiki-light":`#24292e`,"--shiki-dark":`#e1e4e8`,"--shiki-light-bg":`#fff`,"--shiki-dark-bg":`#24292e`},tabIndex:`0`,icon:`<svg viewBox="0 0 24 24"><path d="M 6,1 C 4.354992,1 3,2.354992 3,4 v 16 c 0,1.645008 1.354992,3 3,3 h 12 c 1.645008,0 3,-1.354992 3,-3 V 8 7 A 1.0001,1.0001 0 0 0 20.707031,6.2929687 l -5,-5 A 1.0001,1.0001 0 0 0 15,1 h -1 z m 0,2 h 7 v 3 c 0,1.645008 1.354992,3 3,3 h 3 v 11 c 0,0.564129 -0.435871,1 -1,1 H 6 C 5.4358712,21 5,20.564129 5,20 V 4 C 5,3.4358712 5.4358712,3 6,3 Z M 15,3.4140625 18.585937,7 H 16 C 15.435871,7 15,6.5641288 15,6 Z" fill="currentColor" /></svg>`,children:(0,n.jsx)(t.code,{children:(0,n.jsx)(t.span,{className:`line`,children:(0,n.jsx)(t.span,{children:`void`})})})})}),`
`,(0,n.jsx)(t.hr,{}),`
`,(0,n.jsx)(`span`,{id:`method_createDir`}),`
`,(0,n.jsx)(t.h3,{id:`createdir`,children:`createDir`}),`
`,(0,n.jsx)(n.Fragment,{children:(0,n.jsx)(t.pre,{className:`shiki shiki-themes github-light github-dark`,style:{"--shiki-light":`#24292e`,"--shiki-dark":`#e1e4e8`,"--shiki-light-bg":`#fff`,"--shiki-dark-bg":`#24292e`},tabIndex:`0`,icon:`<svg viewBox="0 0 24 24"><path d="M 6,1 C 4.354992,1 3,2.354992 3,4 v 16 c 0,1.645008 1.354992,3 3,3 h 12 c 1.645008,0 3,-1.354992 3,-3 V 8 7 A 1.0001,1.0001 0 0 0 20.707031,6.2929687 l -5,-5 A 1.0001,1.0001 0 0 0 15,1 h -1 z m 0,2 h 7 v 3 c 0,1.645008 1.354992,3 3,3 h 3 v 11 c 0,0.564129 -0.435871,1 -1,1 H 6 C 5.4358712,21 5,20.564129 5,20 V 4 C 5,3.4358712 5.4358712,3 6,3 Z M 15,3.4140625 18.585937,7 H 16 C 15.435871,7 15,6.5641288 15,6 Z" fill="currentColor" /></svg>`,children:(0,n.jsx)(t.code,{children:(0,n.jsx)(t.span,{className:`line`,children:(0,n.jsx)(t.span,{children:`static public createDir(string  service = "DataManager", string  module = "mhadmin", int  permission = 0755, string  ...paths) : bool`})})})})}),`
`,(0,n.jsx)(t.h5,{id:`краткое-содержание-3`,children:`Краткое содержание`}),`
`,(0,n.jsx)(t.p,{children:`Создаёт папку(и) по указанным путям с заданными правами доступа.`}),`
`,(0,n.jsx)(t.h5,{id:`описание-3`,children:`Описание`}),`
`,(0,n.jsxs)(t.p,{children:[`Для каждого предоставленного пути создаётся директория, если она ещё не существует.
При возникновении ошибки (например, неудачного создания директории)
ошибка логируется через `,(0,n.jsx)(t.code,{children:`LogGenerator::generate_log`}),`.`]}),`
`,(0,n.jsx)(t.h5,{id:`свойства-3`,children:`Свойства:`}),`
`,(0,n.jsxs)(t.table,{children:[(0,n.jsx)(t.thead,{children:(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.th,{children:`Название`}),(0,n.jsx)(t.th,{children:`Тип`}),(0,n.jsx)(t.th,{children:`По умолчанию`})]})}),(0,n.jsxs)(t.tbody,{children:[(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.td,{children:(0,n.jsx)(t.strong,{children:`$service`})}),(0,n.jsx)(t.td,{children:`string`}),(0,n.jsx)(t.td,{children:`'DataManager'`})]}),(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.td,{children:(0,n.jsx)(t.strong,{children:`$module`})}),(0,n.jsx)(t.td,{children:`string`}),(0,n.jsx)(t.td,{children:`'mhadmin'`})]}),(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.td,{children:(0,n.jsx)(t.strong,{children:`$permission`})}),(0,n.jsx)(t.td,{children:`int`}),(0,n.jsx)(t.td,{children:`0755`})]}),(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.td,{children:(0,n.jsx)(t.strong,{children:`$paths`})}),(0,n.jsx)(t.td,{children:`string`}),(0,n.jsx)(t.td,{})]})]})]}),`
`,(0,n.jsx)(t.h5,{id:`ошибки-1`,children:`Ошибки:`}),`
`,(0,n.jsxs)(t.table,{children:[(0,n.jsx)(t.thead,{children:(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.th,{children:`Тип`}),(0,n.jsx)(t.th,{children:`Описание`})]})}),(0,n.jsxs)(t.tbody,{children:[(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.td,{children:`\\RuntimeException`}),(0,n.jsx)(t.td,{children:`Бросается, если директория не может быть создана.`})]}),(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.td,{children:`\\JsonException|\\Throwable`}),(0,n.jsx)(t.td,{children:`Может быть вызван, если ошибка логирования связана с кодировкой JSON.`})]})]})]}),`
`,(0,n.jsx)(t.h5,{id:`возвращает-2`,children:`Возвращает:`}),`
`,(0,n.jsx)(n.Fragment,{children:(0,n.jsx)(t.pre,{className:`shiki shiki-themes github-light github-dark`,style:{"--shiki-light":`#24292e`,"--shiki-dark":`#e1e4e8`,"--shiki-light-bg":`#fff`,"--shiki-dark-bg":`#24292e`},tabIndex:`0`,icon:`<svg viewBox="0 0 24 24"><path d="M 6,1 C 4.354992,1 3,2.354992 3,4 v 16 c 0,1.645008 1.354992,3 3,3 h 12 c 1.645008,0 3,-1.354992 3,-3 V 8 7 A 1.0001,1.0001 0 0 0 20.707031,6.2929687 l -5,-5 A 1.0001,1.0001 0 0 0 15,1 h -1 z m 0,2 h 7 v 3 c 0,1.645008 1.354992,3 3,3 h 3 v 11 c 0,0.564129 -0.435871,1 -1,1 H 6 C 5.4358712,21 5,20.564129 5,20 V 4 C 5,3.4358712 5.4358712,3 6,3 Z M 15,3.4140625 18.585937,7 H 16 C 15.435871,7 15,6.5641288 15,6 Z" fill="currentColor" /></svg>`,children:(0,n.jsx)(t.code,{children:(0,n.jsx)(t.span,{className:`line`,children:(0,n.jsx)(t.span,{children:`bool`})})})})}),`
`,(0,n.jsxs)(t.p,{children:[`Возвращает `,(0,n.jsx)(t.code,{children:`true`}),`, если все директории успешно созданы, иначе `,(0,n.jsx)(t.code,{children:`false`}),`.`]}),`
`,(0,n.jsx)(t.hr,{}),`
`,(0,n.jsx)(`span`,{id:`method_createLockFile`}),`
`,(0,n.jsx)(t.h3,{id:`createlockfile`,children:`createLockFile`}),`
`,(0,n.jsx)(n.Fragment,{children:(0,n.jsx)(t.pre,{className:`shiki shiki-themes github-light github-dark`,style:{"--shiki-light":`#24292e`,"--shiki-dark":`#e1e4e8`,"--shiki-light-bg":`#fff`,"--shiki-dark-bg":`#24292e`},tabIndex:`0`,icon:`<svg viewBox="0 0 24 24"><path d="M 6,1 C 4.354992,1 3,2.354992 3,4 v 16 c 0,1.645008 1.354992,3 3,3 h 12 c 1.645008,0 3,-1.354992 3,-3 V 8 7 A 1.0001,1.0001 0 0 0 20.707031,6.2929687 l -5,-5 A 1.0001,1.0001 0 0 0 15,1 h -1 z m 0,2 h 7 v 3 c 0,1.645008 1.354992,3 3,3 h 3 v 11 c 0,0.564129 -0.435871,1 -1,1 H 6 C 5.4358712,21 5,20.564129 5,20 V 4 C 5,3.4358712 5.4358712,3 6,3 Z M 15,3.4140625 18.585937,7 H 16 C 15.435871,7 15,6.5641288 15,6 Z" fill="currentColor" /></svg>`,children:(0,n.jsx)(t.code,{children:(0,n.jsx)(t.span,{className:`line`,children:(0,n.jsx)(t.span,{children:`static public createLockFile(string  path) : mixed`})})})})}),`
`,(0,n.jsx)(t.h5,{id:`свойства-4`,children:`Свойства:`}),`
`,(0,n.jsxs)(t.table,{children:[(0,n.jsx)(t.thead,{children:(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.th,{children:`Название`}),(0,n.jsx)(t.th,{children:`Тип`}),(0,n.jsx)(t.th,{children:`По умолчанию`})]})}),(0,n.jsx)(t.tbody,{children:(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.td,{children:(0,n.jsx)(t.strong,{children:`$path`})}),(0,n.jsx)(t.td,{children:`string`}),(0,n.jsx)(t.td,{})]})})]}),`
`,(0,n.jsx)(t.h5,{id:`ошибки-2`,children:`Ошибки:`}),`
`,(0,n.jsxs)(t.table,{children:[(0,n.jsx)(t.thead,{children:(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.th,{children:`Тип`}),(0,n.jsx)(t.th,{children:`Описание`})]})}),(0,n.jsxs)(t.tbody,{children:[(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.td,{children:`\\Throwable`}),(0,n.jsx)(t.td,{})]}),(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.td,{children:`\\JsonException`}),(0,n.jsx)(t.td,{})]})]})]}),`
`,(0,n.jsx)(t.h5,{id:`возвращает-3`,children:`Возвращает:`}),`
`,(0,n.jsx)(n.Fragment,{children:(0,n.jsx)(t.pre,{className:`shiki shiki-themes github-light github-dark`,style:{"--shiki-light":`#24292e`,"--shiki-dark":`#e1e4e8`,"--shiki-light-bg":`#fff`,"--shiki-dark-bg":`#24292e`},tabIndex:`0`,icon:`<svg viewBox="0 0 24 24"><path d="M 6,1 C 4.354992,1 3,2.354992 3,4 v 16 c 0,1.645008 1.354992,3 3,3 h 12 c 1.645008,0 3,-1.354992 3,-3 V 8 7 A 1.0001,1.0001 0 0 0 20.707031,6.2929687 l -5,-5 A 1.0001,1.0001 0 0 0 15,1 h -1 z m 0,2 h 7 v 3 c 0,1.645008 1.354992,3 3,3 h 3 v 11 c 0,0.564129 -0.435871,1 -1,1 H 6 C 5.4358712,21 5,20.564129 5,20 V 4 C 5,3.4358712 5.4358712,3 6,3 Z M 15,3.4140625 18.585937,7 H 16 C 15.435871,7 15,6.5641288 15,6 Z" fill="currentColor" /></svg>`,children:(0,n.jsx)(t.code,{children:(0,n.jsx)(t.span,{className:`line`,children:(0,n.jsx)(t.span,{children:`mixed`})})})})}),`
`,(0,n.jsx)(t.hr,{}),`
`,(0,n.jsx)(`span`,{id:`method_defType`}),`
`,(0,n.jsx)(t.h3,{id:`deftype`,children:`defType`}),`
`,(0,n.jsx)(n.Fragment,{children:(0,n.jsx)(t.pre,{className:`shiki shiki-themes github-light github-dark`,style:{"--shiki-light":`#24292e`,"--shiki-dark":`#e1e4e8`,"--shiki-light-bg":`#fff`,"--shiki-dark-bg":`#24292e`},tabIndex:`0`,icon:`<svg viewBox="0 0 24 24"><path d="M 6,1 C 4.354992,1 3,2.354992 3,4 v 16 c 0,1.645008 1.354992,3 3,3 h 12 c 1.645008,0 3,-1.354992 3,-3 V 8 7 A 1.0001,1.0001 0 0 0 20.707031,6.2929687 l -5,-5 A 1.0001,1.0001 0 0 0 15,1 h -1 z m 0,2 h 7 v 3 c 0,1.645008 1.354992,3 3,3 h 3 v 11 c 0,0.564129 -0.435871,1 -1,1 H 6 C 5.4358712,21 5,20.564129 5,20 V 4 C 5,3.4358712 5.4358712,3 6,3 Z M 15,3.4140625 18.585937,7 H 16 C 15.435871,7 15,6.5641288 15,6 Z" fill="currentColor" /></svg>`,children:(0,n.jsx)(t.code,{children:(0,n.jsx)(t.span,{className:`line`,children:(0,n.jsx)(t.span,{children:`static public defType(mixed  value, string  type) : float|bool|int|string`})})})})}),`
`,(0,n.jsx)(t.h5,{id:`краткое-содержание-4`,children:`Краткое содержание`}),`
`,(0,n.jsx)(t.p,{children:`Приводит значение к указанному типу, если возможно, используя набор фильтров.`}),`
`,(0,n.jsx)(t.h5,{id:`описание-4`,children:`Описание`}),`
`,(0,n.jsx)(t.p,{children:`Функция принимает значение и тип, преобразует значение к заданному типу с использованием соответствующего
фильтра. Если преобразование невозможно, возвращается строковое представление значения.`}),`
`,(0,n.jsx)(t.p,{children:`Поддерживаемые типы:`}),`
`,(0,n.jsxs)(t.ul,{children:[`
`,(0,n.jsxs)(t.li,{children:[(0,n.jsx)(t.code,{children:`double`}),`, `,(0,n.jsx)(t.code,{children:`float`}),`: преобразование в число с плавающей точкой.`]}),`
`,(0,n.jsxs)(t.li,{children:[(0,n.jsx)(t.code,{children:`boolean`}),`, `,(0,n.jsx)(t.code,{children:`bool`}),`: преобразование в булево значение.`]}),`
`,(0,n.jsxs)(t.li,{children:[(0,n.jsx)(t.code,{children:`integer`}),`, `,(0,n.jsx)(t.code,{children:`int`}),`, `,(0,n.jsx)(t.code,{children:`tinyint`}),`: преобразование в целое число.`]}),`
`,(0,n.jsxs)(t.li,{children:[(0,n.jsx)(t.code,{children:`string`}),`: фильтрация как строка.`]}),`
`]}),`
`,(0,n.jsx)(t.p,{children:`Если указанный тип отсутствует в карте типов, функция возвращает строковое представление значения.`}),`
`,(0,n.jsx)(t.h5,{id:`свойства-5`,children:`Свойства:`}),`
`,(0,n.jsxs)(t.table,{children:[(0,n.jsx)(t.thead,{children:(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.th,{children:`Название`}),(0,n.jsx)(t.th,{children:`Тип`}),(0,n.jsx)(t.th,{children:`По умолчанию`})]})}),(0,n.jsxs)(t.tbody,{children:[(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.td,{children:(0,n.jsx)(t.strong,{children:`$value`})}),(0,n.jsx)(t.td,{children:`mixed`}),(0,n.jsx)(t.td,{})]}),(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.td,{children:(0,n.jsx)(t.strong,{children:`$type`})}),(0,n.jsx)(t.td,{children:`string`}),(0,n.jsx)(t.td,{})]})]})]}),`
`,(0,n.jsx)(t.h5,{id:`ошибки-3`,children:`Ошибки:`}),`
`,(0,n.jsxs)(t.table,{children:[(0,n.jsx)(t.thead,{children:(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.th,{children:`Тип`}),(0,n.jsx)(t.th,{children:`Описание`})]})}),(0,n.jsx)(t.tbody,{children:(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.td,{children:`\\ValueError`}),(0,n.jsxs)(t.td,{children:[`Исключение может быть выброшено, если `,(0,n.jsx)(t.code,{children:`filter_var`}),` получит некорректный фильтр.`]})]})})]}),`
`,(0,n.jsx)(t.h5,{id:`возвращает-4`,children:`Возвращает:`}),`
`,(0,n.jsx)(n.Fragment,{children:(0,n.jsx)(t.pre,{className:`shiki shiki-themes github-light github-dark`,style:{"--shiki-light":`#24292e`,"--shiki-dark":`#e1e4e8`,"--shiki-light-bg":`#fff`,"--shiki-dark-bg":`#24292e`},tabIndex:`0`,icon:`<svg viewBox="0 0 24 24"><path d="M 6,1 C 4.354992,1 3,2.354992 3,4 v 16 c 0,1.645008 1.354992,3 3,3 h 12 c 1.645008,0 3,-1.354992 3,-3 V 8 7 A 1.0001,1.0001 0 0 0 20.707031,6.2929687 l -5,-5 A 1.0001,1.0001 0 0 0 15,1 h -1 z m 0,2 h 7 v 3 c 0,1.645008 1.354992,3 3,3 h 3 v 11 c 0,0.564129 -0.435871,1 -1,1 H 6 C 5.4358712,21 5,20.564129 5,20 V 4 C 5,3.4358712 5.4358712,3 6,3 Z M 15,3.4140625 18.585937,7 H 16 C 15.435871,7 15,6.5641288 15,6 Z" fill="currentColor" /></svg>`,children:(0,n.jsx)(t.code,{children:(0,n.jsx)(t.span,{className:`line`,children:(0,n.jsx)(t.span,{children:`float|bool|int|string`})})})})}),`
`,(0,n.jsx)(t.p,{children:`Преобразованное значение в заданный тип, либо строковое представление значения,
если преобразование невозможно или тип неизвестен.`}),`
`,(0,n.jsx)(t.hr,{}),`
`,(0,n.jsx)(`span`,{id:`method_deleteDir`}),`
`,(0,n.jsx)(t.h3,{id:`deletedir`,children:`deleteDir`}),`
`,(0,n.jsx)(n.Fragment,{children:(0,n.jsx)(t.pre,{className:`shiki shiki-themes github-light github-dark`,style:{"--shiki-light":`#24292e`,"--shiki-dark":`#e1e4e8`,"--shiki-light-bg":`#fff`,"--shiki-dark-bg":`#24292e`},tabIndex:`0`,icon:`<svg viewBox="0 0 24 24"><path d="M 6,1 C 4.354992,1 3,2.354992 3,4 v 16 c 0,1.645008 1.354992,3 3,3 h 12 c 1.645008,0 3,-1.354992 3,-3 V 8 7 A 1.0001,1.0001 0 0 0 20.707031,6.2929687 l -5,-5 A 1.0001,1.0001 0 0 0 15,1 h -1 z m 0,2 h 7 v 3 c 0,1.645008 1.354992,3 3,3 h 3 v 11 c 0,0.564129 -0.435871,1 -1,1 H 6 C 5.4358712,21 5,20.564129 5,20 V 4 C 5,3.4358712 5.4358712,3 6,3 Z M 15,3.4140625 18.585937,7 H 16 C 15.435871,7 15,6.5641288 15,6 Z" fill="currentColor" /></svg>`,children:(0,n.jsx)(t.code,{children:(0,n.jsx)(t.span,{className:`line`,children:(0,n.jsx)(t.span,{children:`static public deleteDir(string  path) : void`})})})})}),`
`,(0,n.jsx)(t.h5,{id:`краткое-содержание-5`,children:`Краткое содержание`}),`
`,(0,n.jsx)(t.p,{children:`Полностью удаляет директорию и все её содержимое, включая файлы и вложенные директории.`}),`
`,(0,n.jsx)(t.h5,{id:`описание-5`,children:`Описание`}),`
`,(0,n.jsx)(t.p,{children:`Эта функция рекурсивно обходит заданный путь, удаляя все файлы и вложенные директории,
а затем удаляет саму директорию. Игнорирует защищённую директорию,
путь к которой жёстко прописан в коде.`}),`
`,(0,n.jsx)(t.h5,{id:`свойства-6`,children:`Свойства:`}),`
`,(0,n.jsxs)(t.table,{children:[(0,n.jsx)(t.thead,{children:(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.th,{children:`Название`}),(0,n.jsx)(t.th,{children:`Тип`}),(0,n.jsx)(t.th,{children:`По умолчанию`})]})}),(0,n.jsx)(t.tbody,{children:(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.td,{children:(0,n.jsx)(t.strong,{children:`$path`})}),(0,n.jsx)(t.td,{children:`string`}),(0,n.jsx)(t.td,{})]})})]}),`
`,(0,n.jsx)(t.h5,{id:`ошибки-4`,children:`Ошибки:`}),`
`,(0,n.jsxs)(t.table,{children:[(0,n.jsx)(t.thead,{children:(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.th,{children:`Тип`}),(0,n.jsx)(t.th,{children:`Описание`})]})}),(0,n.jsx)(t.tbody,{children:(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.td,{children:`\\UnexpectedValueException`}),(0,n.jsx)(t.td,{children:`В случае, если переданный путь не является директорией или не может быть прочитан.`})]})})]}),`
`,(0,n.jsx)(t.h5,{id:`возвращает-5`,children:`Возвращает:`}),`
`,(0,n.jsx)(n.Fragment,{children:(0,n.jsx)(t.pre,{className:`shiki shiki-themes github-light github-dark`,style:{"--shiki-light":`#24292e`,"--shiki-dark":`#e1e4e8`,"--shiki-light-bg":`#fff`,"--shiki-dark-bg":`#24292e`},tabIndex:`0`,icon:`<svg viewBox="0 0 24 24"><path d="M 6,1 C 4.354992,1 3,2.354992 3,4 v 16 c 0,1.645008 1.354992,3 3,3 h 12 c 1.645008,0 3,-1.354992 3,-3 V 8 7 A 1.0001,1.0001 0 0 0 20.707031,6.2929687 l -5,-5 A 1.0001,1.0001 0 0 0 15,1 h -1 z m 0,2 h 7 v 3 c 0,1.645008 1.354992,3 3,3 h 3 v 11 c 0,0.564129 -0.435871,1 -1,1 H 6 C 5.4358712,21 5,20.564129 5,20 V 4 C 5,3.4358712 5.4358712,3 6,3 Z M 15,3.4140625 18.585937,7 H 16 C 15.435871,7 15,6.5641288 15,6 Z" fill="currentColor" /></svg>`,children:(0,n.jsx)(t.code,{children:(0,n.jsx)(t.span,{className:`line`,children:(0,n.jsx)(t.span,{children:`void`})})})})}),`
`,(0,n.jsx)(t.hr,{}),`
`,(0,n.jsx)(`span`,{id:`method_dirToArray`}),`
`,(0,n.jsx)(t.h3,{id:`dirtoarray`,children:`dirToArray`}),`
`,(0,n.jsx)(n.Fragment,{children:(0,n.jsx)(t.pre,{className:`shiki shiki-themes github-light github-dark`,style:{"--shiki-light":`#24292e`,"--shiki-dark":`#e1e4e8`,"--shiki-light-bg":`#fff`,"--shiki-dark-bg":`#24292e`},tabIndex:`0`,icon:`<svg viewBox="0 0 24 24"><path d="M 6,1 C 4.354992,1 3,2.354992 3,4 v 16 c 0,1.645008 1.354992,3 3,3 h 12 c 1.645008,0 3,-1.354992 3,-3 V 8 7 A 1.0001,1.0001 0 0 0 20.707031,6.2929687 l -5,-5 A 1.0001,1.0001 0 0 0 15,1 h -1 z m 0,2 h 7 v 3 c 0,1.645008 1.354992,3 3,3 h 3 v 11 c 0,0.564129 -0.435871,1 -1,1 H 6 C 5.4358712,21 5,20.564129 5,20 V 4 C 5,3.4358712 5.4358712,3 6,3 Z M 15,3.4140625 18.585937,7 H 16 C 15.435871,7 15,6.5641288 15,6 Z" fill="currentColor" /></svg>`,children:(0,n.jsx)(t.code,{children:(0,n.jsx)(t.span,{className:`line`,children:(0,n.jsx)(t.span,{children:`static public dirToArray(string  dir, mixed  ..._ext) : array`})})})})}),`
`,(0,n.jsx)(t.h5,{id:`краткое-содержание-6`,children:`Краткое содержание`}),`
`,(0,n.jsx)(t.p,{children:`Преобразует указанную директорию в массив, содержащий все папки и файлы из неё.`}),`
`,(0,n.jsx)(t.h5,{id:`описание-6`,children:`Описание`}),`
`,(0,n.jsxs)(t.p,{children:[`Этот метод является обёрткой для функции `,(0,n.jsx)(t.code,{children:`dirToArray`}),` и вызывает её с переданными
параметрами. Используется для рекурсивного получения структуры директорий и файлов
в виде массива.`]}),`
`,(0,n.jsx)(t.h5,{id:`смотри-так-же-2`,children:`Смотри так-же:`}),`
`,(0,n.jsxs)(t.ul,{children:[`
`,(0,n.jsx)(t.li,{children:(0,n.jsx)(t.a,{href:`../index#function_dirToArray`,children:`\\dirToArray()`})}),`
`]}),`
`,(0,n.jsx)(t.h5,{id:`свойства-7`,children:`Свойства:`}),`
`,(0,n.jsxs)(t.table,{children:[(0,n.jsx)(t.thead,{children:(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.th,{children:`Название`}),(0,n.jsx)(t.th,{children:`Тип`}),(0,n.jsx)(t.th,{children:`По умолчанию`})]})}),(0,n.jsxs)(t.tbody,{children:[(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.td,{children:(0,n.jsx)(t.strong,{children:`$dir`})}),(0,n.jsx)(t.td,{children:`string`}),(0,n.jsx)(t.td,{})]}),(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.td,{children:(0,n.jsx)(t.strong,{children:`$_ext`})}),(0,n.jsx)(t.td,{children:`mixed`}),(0,n.jsx)(t.td,{})]})]})]}),`
`,(0,n.jsx)(t.h5,{id:`возвращает-6`,children:`Возвращает:`}),`
`,(0,n.jsx)(n.Fragment,{children:(0,n.jsx)(t.pre,{className:`shiki shiki-themes github-light github-dark`,style:{"--shiki-light":`#24292e`,"--shiki-dark":`#e1e4e8`,"--shiki-light-bg":`#fff`,"--shiki-dark-bg":`#24292e`},tabIndex:`0`,icon:`<svg viewBox="0 0 24 24"><path d="M 6,1 C 4.354992,1 3,2.354992 3,4 v 16 c 0,1.645008 1.354992,3 3,3 h 12 c 1.645008,0 3,-1.354992 3,-3 V 8 7 A 1.0001,1.0001 0 0 0 20.707031,6.2929687 l -5,-5 A 1.0001,1.0001 0 0 0 15,1 h -1 z m 0,2 h 7 v 3 c 0,1.645008 1.354992,3 3,3 h 3 v 11 c 0,0.564129 -0.435871,1 -1,1 H 6 C 5.4358712,21 5,20.564129 5,20 V 4 C 5,3.4358712 5.4358712,3 6,3 Z M 15,3.4140625 18.585937,7 H 16 C 15.435871,7 15,6.5641288 15,6 Z" fill="currentColor" /></svg>`,children:(0,n.jsx)(t.code,{children:(0,n.jsx)(t.span,{className:`line`,children:(0,n.jsx)(t.span,{children:`array`})})})})}),`
`,(0,n.jsx)(t.p,{children:`Ассоциативный массив, где ключами могут быть директории, а значения —
содержимое этих директорий; файлы представлены в виде элементов массива.`}),`
`,(0,n.jsx)(t.hr,{}),`
`,(0,n.jsx)(`span`,{id:`method_getComparer`}),`
`,(0,n.jsx)(t.h3,{id:`getcomparer`,children:`getComparer`}),`
`,(0,n.jsx)(n.Fragment,{children:(0,n.jsx)(t.pre,{className:`shiki shiki-themes github-light github-dark`,style:{"--shiki-light":`#24292e`,"--shiki-dark":`#e1e4e8`,"--shiki-light-bg":`#fff`,"--shiki-dark-bg":`#24292e`},tabIndex:`0`,icon:`<svg viewBox="0 0 24 24"><path d="M 6,1 C 4.354992,1 3,2.354992 3,4 v 16 c 0,1.645008 1.354992,3 3,3 h 12 c 1.645008,0 3,-1.354992 3,-3 V 8 7 A 1.0001,1.0001 0 0 0 20.707031,6.2929687 l -5,-5 A 1.0001,1.0001 0 0 0 15,1 h -1 z m 0,2 h 7 v 3 c 0,1.645008 1.354992,3 3,3 h 3 v 11 c 0,0.564129 -0.435871,1 -1,1 H 6 C 5.4358712,21 5,20.564129 5,20 V 4 C 5,3.4358712 5.4358712,3 6,3 Z M 15,3.4140625 18.585937,7 H 16 C 15.435871,7 15,6.5641288 15,6 Z" fill="currentColor" /></svg>`,children:(0,n.jsx)(t.code,{children:(0,n.jsx)(t.span,{className:`line`,children:(0,n.jsx)(t.span,{children:`static public getComparer(mixed  value) : string`})})})})}),`
`,(0,n.jsx)(t.h5,{id:`краткое-содержание-7`,children:`Краткое содержание`}),`
`,(0,n.jsx)(t.p,{children:`Формирует строку, представляющую оператор сравнения и значение, основанную на переданном значении.`}),`
`,(0,n.jsx)(t.h5,{id:`описание-7`,children:`Описание`}),`
`,(0,n.jsx)(t.p,{children:`Эта функция анализирует начальный символ переданного значения, чтобы определить оператор сравнения
(например, '=', '<', '>', 'LIKE', '<>', '<=',
'>='). Если переданный оператор — '%', то значение
оборачивается в проценты для использования в операциях LIKE. Если значение начинается с других
специальных символов, оно интерпретируется и оператор определяется автоматически.
При необходимости значение преобразуется в указанный тип.`}),`
`,(0,n.jsx)(t.h5,{id:`свойства-8`,children:`Свойства:`}),`
`,(0,n.jsxs)(t.table,{children:[(0,n.jsx)(t.thead,{children:(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.th,{children:`Название`}),(0,n.jsx)(t.th,{children:`Тип`}),(0,n.jsx)(t.th,{children:`По умолчанию`})]})}),(0,n.jsx)(t.tbody,{children:(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.td,{children:(0,n.jsx)(t.strong,{children:`$value`})}),(0,n.jsx)(t.td,{children:`mixed`}),(0,n.jsx)(t.td,{})]})})]}),`
`,(0,n.jsx)(t.h5,{id:`ошибки-5`,children:`Ошибки:`}),`
`,(0,n.jsxs)(t.table,{children:[(0,n.jsx)(t.thead,{children:(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.th,{children:`Тип`}),(0,n.jsx)(t.th,{children:`Описание`})]})}),(0,n.jsx)(t.tbody,{children:(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.td,{children:`\\InvalidArgumentException`}),(0,n.jsx)(t.td,{children:`Если передано некорректное значение или тип недопустим для обработки.`})]})})]}),`
`,(0,n.jsx)(t.h5,{id:`возвращает-7`,children:`Возвращает:`}),`
`,(0,n.jsx)(n.Fragment,{children:(0,n.jsx)(t.pre,{className:`shiki shiki-themes github-light github-dark`,style:{"--shiki-light":`#24292e`,"--shiki-dark":`#e1e4e8`,"--shiki-light-bg":`#fff`,"--shiki-dark-bg":`#24292e`},tabIndex:`0`,icon:`<svg viewBox="0 0 24 24"><path d="M 6,1 C 4.354992,1 3,2.354992 3,4 v 16 c 0,1.645008 1.354992,3 3,3 h 12 c 1.645008,0 3,-1.354992 3,-3 V 8 7 A 1.0001,1.0001 0 0 0 20.707031,6.2929687 l -5,-5 A 1.0001,1.0001 0 0 0 15,1 h -1 z m 0,2 h 7 v 3 c 0,1.645008 1.354992,3 3,3 h 3 v 11 c 0,0.564129 -0.435871,1 -1,1 H 6 C 5.4358712,21 5,20.564129 5,20 V 4 C 5,3.4358712 5.4358712,3 6,3 Z M 15,3.4140625 18.585937,7 H 16 C 15.435871,7 15,6.5641288 15,6 Z" fill="currentColor" /></svg>`,children:(0,n.jsx)(t.code,{children:(0,n.jsx)(t.span,{className:`line`,children:(0,n.jsx)(t.span,{children:`string`})})})})}),`
`,(0,n.jsx)(t.p,{children:`Строка, представляющая оператор сравнения и значение, готовая для использования
в SQL- или других выражениях. Например: " = 'some_value'", "< 10", или " LIKE
'%abc%'".`}),`
`,(0,n.jsx)(t.hr,{}),`
`,(0,n.jsx)(`span`,{id:`method_getConfig`}),`
`,(0,n.jsx)(t.h3,{id:`getconfig`,children:`getConfig`}),`
`,(0,n.jsx)(n.Fragment,{children:(0,n.jsx)(t.pre,{className:`shiki shiki-themes github-light github-dark`,style:{"--shiki-light":`#24292e`,"--shiki-dark":`#e1e4e8`,"--shiki-light-bg":`#fff`,"--shiki-dark-bg":`#24292e`},tabIndex:`0`,icon:`<svg viewBox="0 0 24 24"><path d="M 6,1 C 4.354992,1 3,2.354992 3,4 v 16 c 0,1.645008 1.354992,3 3,3 h 12 c 1.645008,0 3,-1.354992 3,-3 V 8 7 A 1.0001,1.0001 0 0 0 20.707031,6.2929687 l -5,-5 A 1.0001,1.0001 0 0 0 15,1 h -1 z m 0,2 h 7 v 3 c 0,1.645008 1.354992,3 3,3 h 3 v 11 c 0,0.564129 -0.435871,1 -1,1 H 6 C 5.4358712,21 5,20.564129 5,20 V 4 C 5,3.4358712 5.4358712,3 6,3 Z M 15,3.4140625 18.585937,7 H 16 C 15.435871,7 15,6.5641288 15,6 Z" fill="currentColor" /></svg>`,children:(0,n.jsx)(t.code,{children:(0,n.jsx)(t.span,{className:`line`,children:(0,n.jsx)(t.span,{children:`static public getConfig(string  codename, string|null  path = null, string|null  confName = null) : array`})})})})}),`
`,(0,n.jsx)(t.h5,{id:`краткое-содержание-8`,children:`Краткое содержание`}),`
`,(0,n.jsx)(t.p,{children:`Получает конфигурацию на основе указанного кода имени и пути к файлу JSON.`}),`
`,(0,n.jsx)(t.h5,{id:`описание-8`,children:`Описание`}),`
`,(0,n.jsx)(t.p,{children:`Метод сначала пытается загрузить конфигурацию из указанного или стандартного пути.
Если файл не найден, он проверяет, указано ли устаревшее имя конфигурации
для выполнения миграции данных. Если миграция невозможна, возвращается пустой массив.`}),`
`,(0,n.jsx)(t.h5,{id:`свойства-9`,children:`Свойства:`}),`
`,(0,n.jsxs)(t.table,{children:[(0,n.jsx)(t.thead,{children:(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.th,{children:`Название`}),(0,n.jsx)(t.th,{children:`Тип`}),(0,n.jsx)(t.th,{children:`По умолчанию`})]})}),(0,n.jsxs)(t.tbody,{children:[(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.td,{children:(0,n.jsx)(t.strong,{children:`$codename`})}),(0,n.jsx)(t.td,{children:`string`}),(0,n.jsx)(t.td,{})]}),(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.td,{children:(0,n.jsx)(t.strong,{children:`$path`})}),(0,n.jsx)(t.td,{children:`string|null`}),(0,n.jsx)(t.td,{children:`null`})]}),(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.td,{children:(0,n.jsx)(t.strong,{children:`$confName`})}),(0,n.jsx)(t.td,{children:`string|null`}),(0,n.jsx)(t.td,{children:`null`})]})]})]}),`
`,(0,n.jsx)(t.h5,{id:`ошибки-6`,children:`Ошибки:`}),`
`,(0,n.jsxs)(t.table,{children:[(0,n.jsx)(t.thead,{children:(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.th,{children:`Тип`}),(0,n.jsx)(t.th,{children:`Описание`})]})}),(0,n.jsxs)(t.tbody,{children:[(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.td,{children:`\\JsonException`}),(0,n.jsxs)(t.td,{children:[`Если содержимое JSON-файла некорректно при вызове `,(0,n.jsx)(t.code,{children:`loadJsonConfig`}),`.`]})]}),(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.td,{children:`\\RuntimeException`}),(0,n.jsx)(t.td,{children:`Если ошибка возникает во время миграции конфигурации.`})]})]})]}),`
`,(0,n.jsx)(t.h5,{id:`возвращает-8`,children:`Возвращает:`}),`
`,(0,n.jsx)(n.Fragment,{children:(0,n.jsx)(t.pre,{className:`shiki shiki-themes github-light github-dark`,style:{"--shiki-light":`#24292e`,"--shiki-dark":`#e1e4e8`,"--shiki-light-bg":`#fff`,"--shiki-dark-bg":`#24292e`},tabIndex:`0`,icon:`<svg viewBox="0 0 24 24"><path d="M 6,1 C 4.354992,1 3,2.354992 3,4 v 16 c 0,1.645008 1.354992,3 3,3 h 12 c 1.645008,0 3,-1.354992 3,-3 V 8 7 A 1.0001,1.0001 0 0 0 20.707031,6.2929687 l -5,-5 A 1.0001,1.0001 0 0 0 15,1 h -1 z m 0,2 h 7 v 3 c 0,1.645008 1.354992,3 3,3 h 3 v 11 c 0,0.564129 -0.435871,1 -1,1 H 6 C 5.4358712,21 5,20.564129 5,20 V 4 C 5,3.4358712 5.4358712,3 6,3 Z M 15,3.4140625 18.585937,7 H 16 C 15.435871,7 15,6.5641288 15,6 Z" fill="currentColor" /></svg>`,children:(0,n.jsx)(t.code,{children:(0,n.jsx)(t.span,{className:`line`,children:(0,n.jsx)(t.span,{children:`array`})})})})}),`
`,(0,n.jsx)(t.p,{children:`Возвращает массив конфигурации. Если файл или миграция недоступны, возвращается пустой массив.`}),`
`,(0,n.jsx)(t.hr,{}),`
`,(0,n.jsx)(`span`,{id:`method_getDb`}),`
`,(0,n.jsx)(t.h3,{id:`getdb`,children:`getDb`}),`
`,(0,n.jsx)(n.Fragment,{children:(0,n.jsx)(t.pre,{className:`shiki shiki-themes github-light github-dark`,style:{"--shiki-light":`#24292e`,"--shiki-dark":`#e1e4e8`,"--shiki-light-bg":`#fff`,"--shiki-dark-bg":`#24292e`},tabIndex:`0`,icon:`<svg viewBox="0 0 24 24"><path d="M 6,1 C 4.354992,1 3,2.354992 3,4 v 16 c 0,1.645008 1.354992,3 3,3 h 12 c 1.645008,0 3,-1.354992 3,-3 V 8 7 A 1.0001,1.0001 0 0 0 20.707031,6.2929687 l -5,-5 A 1.0001,1.0001 0 0 0 15,1 h -1 z m 0,2 h 7 v 3 c 0,1.645008 1.354992,3 3,3 h 3 v 11 c 0,0.564129 -0.435871,1 -1,1 H 6 C 5.4358712,21 5,20.564129 5,20 V 4 C 5,3.4358712 5.4358712,3 6,3 Z M 15,3.4140625 18.585937,7 H 16 C 15.435871,7 15,6.5641288 15,6 Z" fill="currentColor" /></svg>`,children:(0,n.jsx)(t.code,{children:(0,n.jsx)(t.span,{className:`line`,children:(0,n.jsx)(t.span,{children:`static public getDb() : \\db`})})})})}),`
`,(0,n.jsx)(t.h5,{id:`краткое-содержание-9`,children:`Краткое содержание`}),`
`,(0,n.jsx)(t.p,{children:`Возвращает объект подключения к базе данных.`}),`
`,(0,n.jsx)(t.h5,{id:`описание-9`,children:`Описание`}),`
`,(0,n.jsx)(t.p,{children:`Если подключение еще не было установлено, метод инициирует его вызовом метода connect().`}),`
`,(0,n.jsx)(t.h5,{id:`смотри-так-же-3`,children:`Смотри так-же:`}),`
`,(0,n.jsxs)(t.ul,{children:[`
`,(0,n.jsx)(t.li,{children:(0,n.jsx)(t.a,{href:`#method_connect`,children:`\\DataManager:connect()`})}),`
`,(0,n.jsx)(t.li,{children:(0,n.jsx)(t.a,{href:`#property_db`,children:`\\DataManager::$db`})}),`
`]}),`
`,(0,n.jsx)(t.h5,{id:`возвращает-9`,children:`Возвращает:`}),`
`,(0,n.jsx)(n.Fragment,{children:(0,n.jsx)(t.pre,{className:`shiki shiki-themes github-light github-dark`,style:{"--shiki-light":`#24292e`,"--shiki-dark":`#e1e4e8`,"--shiki-light-bg":`#fff`,"--shiki-dark-bg":`#24292e`},tabIndex:`0`,icon:`<svg viewBox="0 0 24 24"><path d="M 6,1 C 4.354992,1 3,2.354992 3,4 v 16 c 0,1.645008 1.354992,3 3,3 h 12 c 1.645008,0 3,-1.354992 3,-3 V 8 7 A 1.0001,1.0001 0 0 0 20.707031,6.2929687 l -5,-5 A 1.0001,1.0001 0 0 0 15,1 h -1 z m 0,2 h 7 v 3 c 0,1.645008 1.354992,3 3,3 h 3 v 11 c 0,0.564129 -0.435871,1 -1,1 H 6 C 5.4358712,21 5,20.564129 5,20 V 4 C 5,3.4358712 5.4358712,3 6,3 Z M 15,3.4140625 18.585937,7 H 16 C 15.435871,7 15,6.5641288 15,6 Z" fill="currentColor" /></svg>`,children:(0,n.jsx)(t.code,{children:(0,n.jsx)(t.span,{className:`line`,children:(0,n.jsx)(t.span,{children:`\\db`})})})})}),`
`,(0,n.jsx)(t.p,{children:`Объект подключения к базе данных.`}),`
`,(0,n.jsx)(t.hr,{}),`
`,(0,n.jsx)(`span`,{id:`method_getPrefix`}),`
`,(0,n.jsx)(t.h3,{id:`getprefix`,children:`getPrefix`}),`
`,(0,n.jsx)(n.Fragment,{children:(0,n.jsx)(t.pre,{className:`shiki shiki-themes github-light github-dark`,style:{"--shiki-light":`#24292e`,"--shiki-dark":`#e1e4e8`,"--shiki-light-bg":`#fff`,"--shiki-dark-bg":`#24292e`},tabIndex:`0`,icon:`<svg viewBox="0 0 24 24"><path d="M 6,1 C 4.354992,1 3,2.354992 3,4 v 16 c 0,1.645008 1.354992,3 3,3 h 12 c 1.645008,0 3,-1.354992 3,-3 V 8 7 A 1.0001,1.0001 0 0 0 20.707031,6.2929687 l -5,-5 A 1.0001,1.0001 0 0 0 15,1 h -1 z m 0,2 h 7 v 3 c 0,1.645008 1.354992,3 3,3 h 3 v 11 c 0,0.564129 -0.435871,1 -1,1 H 6 C 5.4358712,21 5,20.564129 5,20 V 4 C 5,3.4358712 5.4358712,3 6,3 Z M 15,3.4140625 18.585937,7 H 16 C 15.435871,7 15,6.5641288 15,6 Z" fill="currentColor" /></svg>`,children:(0,n.jsx)(t.code,{children:(0,n.jsx)(t.span,{className:`line`,children:(0,n.jsx)(t.span,{children:`static public getPrefix() : string`})})})})}),`
`,(0,n.jsx)(t.h5,{id:`краткое-содержание-10`,children:`Краткое содержание`}),`
`,(0,n.jsx)(t.p,{children:`Возвращает префикс, заданный в системе.`}),`
`,(0,n.jsx)(t.h5,{id:`возвращает-10`,children:`Возвращает:`}),`
`,(0,n.jsx)(n.Fragment,{children:(0,n.jsx)(t.pre,{className:`shiki shiki-themes github-light github-dark`,style:{"--shiki-light":`#24292e`,"--shiki-dark":`#e1e4e8`,"--shiki-light-bg":`#fff`,"--shiki-dark-bg":`#24292e`},tabIndex:`0`,icon:`<svg viewBox="0 0 24 24"><path d="M 6,1 C 4.354992,1 3,2.354992 3,4 v 16 c 0,1.645008 1.354992,3 3,3 h 12 c 1.645008,0 3,-1.354992 3,-3 V 8 7 A 1.0001,1.0001 0 0 0 20.707031,6.2929687 l -5,-5 A 1.0001,1.0001 0 0 0 15,1 h -1 z m 0,2 h 7 v 3 c 0,1.645008 1.354992,3 3,3 h 3 v 11 c 0,0.564129 -0.435871,1 -1,1 H 6 C 5.4358712,21 5,20.564129 5,20 V 4 C 5,3.4358712 5.4358712,3 6,3 Z M 15,3.4140625 18.585937,7 H 16 C 15.435871,7 15,6.5641288 15,6 Z" fill="currentColor" /></svg>`,children:(0,n.jsx)(t.code,{children:(0,n.jsx)(t.span,{className:`line`,children:(0,n.jsx)(t.span,{children:`string`})})})})}),`
`,(0,n.jsx)(t.p,{children:`Префикс, используемый в системе.`}),`
`,(0,n.jsx)(t.hr,{}),`
`,(0,n.jsx)(`span`,{id:`method_getUserPrefix`}),`
`,(0,n.jsx)(t.h3,{id:`getuserprefix`,children:`getUserPrefix`}),`
`,(0,n.jsx)(n.Fragment,{children:(0,n.jsx)(t.pre,{className:`shiki shiki-themes github-light github-dark`,style:{"--shiki-light":`#24292e`,"--shiki-dark":`#e1e4e8`,"--shiki-light-bg":`#fff`,"--shiki-dark-bg":`#24292e`},tabIndex:`0`,icon:`<svg viewBox="0 0 24 24"><path d="M 6,1 C 4.354992,1 3,2.354992 3,4 v 16 c 0,1.645008 1.354992,3 3,3 h 12 c 1.645008,0 3,-1.354992 3,-3 V 8 7 A 1.0001,1.0001 0 0 0 20.707031,6.2929687 l -5,-5 A 1.0001,1.0001 0 0 0 15,1 h -1 z m 0,2 h 7 v 3 c 0,1.645008 1.354992,3 3,3 h 3 v 11 c 0,0.564129 -0.435871,1 -1,1 H 6 C 5.4358712,21 5,20.564129 5,20 V 4 C 5,3.4358712 5.4358712,3 6,3 Z M 15,3.4140625 18.585937,7 H 16 C 15.435871,7 15,6.5641288 15,6 Z" fill="currentColor" /></svg>`,children:(0,n.jsx)(t.code,{children:(0,n.jsx)(t.span,{className:`line`,children:(0,n.jsx)(t.span,{children:`static public getUserPrefix() : string`})})})})}),`
`,(0,n.jsx)(t.h5,{id:`краткое-содержание-11`,children:`Краткое содержание`}),`
`,(0,n.jsx)(t.p,{children:`Получает префикс пользователя.`}),`
`,(0,n.jsx)(t.h5,{id:`описание-10`,children:`Описание`}),`
`,(0,n.jsxs)(t.p,{children:[`Данный метод возвращает значение константы `,(0,n.jsx)(t.code,{children:`USERPREFIX`}),`.`]}),`
`,(0,n.jsx)(t.h5,{id:`возвращает-11`,children:`Возвращает:`}),`
`,(0,n.jsx)(n.Fragment,{children:(0,n.jsx)(t.pre,{className:`shiki shiki-themes github-light github-dark`,style:{"--shiki-light":`#24292e`,"--shiki-dark":`#e1e4e8`,"--shiki-light-bg":`#fff`,"--shiki-dark-bg":`#24292e`},tabIndex:`0`,icon:`<svg viewBox="0 0 24 24"><path d="M 6,1 C 4.354992,1 3,2.354992 3,4 v 16 c 0,1.645008 1.354992,3 3,3 h 12 c 1.645008,0 3,-1.354992 3,-3 V 8 7 A 1.0001,1.0001 0 0 0 20.707031,6.2929687 l -5,-5 A 1.0001,1.0001 0 0 0 15,1 h -1 z m 0,2 h 7 v 3 c 0,1.645008 1.354992,3 3,3 h 3 v 11 c 0,0.564129 -0.435871,1 -1,1 H 6 C 5.4358712,21 5,20.564129 5,20 V 4 C 5,3.4358712 5.4358712,3 6,3 Z M 15,3.4140625 18.585937,7 H 16 C 15.435871,7 15,6.5641288 15,6 Z" fill="currentColor" /></svg>`,children:(0,n.jsx)(t.code,{children:(0,n.jsx)(t.span,{className:`line`,children:(0,n.jsx)(t.span,{children:`string`})})})})}),`
`,(0,n.jsx)(t.p,{children:`Префикс пользователя.`}),`
`,(0,n.jsx)(t.hr,{}),`
`,(0,n.jsx)(`span`,{id:`method_joinPaths`}),`
`,(0,n.jsx)(t.h3,{id:`joinpaths`,children:`joinPaths`}),`
`,(0,n.jsx)(n.Fragment,{children:(0,n.jsx)(t.pre,{className:`shiki shiki-themes github-light github-dark`,style:{"--shiki-light":`#24292e`,"--shiki-dark":`#e1e4e8`,"--shiki-light-bg":`#fff`,"--shiki-dark-bg":`#24292e`},tabIndex:`0`,icon:`<svg viewBox="0 0 24 24"><path d="M 6,1 C 4.354992,1 3,2.354992 3,4 v 16 c 0,1.645008 1.354992,3 3,3 h 12 c 1.645008,0 3,-1.354992 3,-3 V 8 7 A 1.0001,1.0001 0 0 0 20.707031,6.2929687 l -5,-5 A 1.0001,1.0001 0 0 0 15,1 h -1 z m 0,2 h 7 v 3 c 0,1.645008 1.354992,3 3,3 h 3 v 11 c 0,0.564129 -0.435871,1 -1,1 H 6 C 5.4358712,21 5,20.564129 5,20 V 4 C 5,3.4358712 5.4358712,3 6,3 Z M 15,3.4140625 18.585937,7 H 16 C 15.435871,7 15,6.5641288 15,6 Z" fill="currentColor" /></svg>`,children:(0,n.jsx)(t.code,{children:(0,n.jsx)(t.span,{className:`line`,children:(0,n.jsx)(t.span,{children:`public joinPaths(string  ...paths) : string`})})})})}),`
`,(0,n.jsx)(t.h5,{id:`краткое-содержание-12`,children:`Краткое содержание`}),`
`,(0,n.jsx)(t.p,{children:`Объединяет несколько путей в один.`}),`
`,(0,n.jsx)(t.h5,{id:`описание-11`,children:`Описание`}),`
`,(0,n.jsx)(t.p,{children:`Объединение происходит слева направо. Пустые значения игнорируются.
Возвращаемый путь нормализуется (лишние символы удаляются, контролируется корректность пути).`}),`
`,(0,n.jsx)(t.h5,{id:`свойства-10`,children:`Свойства:`}),`
`,(0,n.jsxs)(t.table,{children:[(0,n.jsx)(t.thead,{children:(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.th,{children:`Название`}),(0,n.jsx)(t.th,{children:`Тип`}),(0,n.jsx)(t.th,{children:`По умолчанию`})]})}),(0,n.jsx)(t.tbody,{children:(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.td,{children:(0,n.jsx)(t.strong,{children:`$paths`})}),(0,n.jsx)(t.td,{children:`string`}),(0,n.jsx)(t.td,{})]})})]}),`
`,(0,n.jsx)(t.h5,{id:`ошибки-7`,children:`Ошибки:`}),`
`,(0,n.jsxs)(t.table,{children:[(0,n.jsx)(t.thead,{children:(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.th,{children:`Тип`}),(0,n.jsx)(t.th,{children:`Описание`})]})}),(0,n.jsx)(t.tbody,{children:(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.td,{children:`\\RuntimeException`}),(0,n.jsx)(t.td,{children:`Если произошла ошибка при нормализации пути.`})]})})]}),`
`,(0,n.jsx)(t.h5,{id:`возвращает-12`,children:`Возвращает:`}),`
`,(0,n.jsx)(n.Fragment,{children:(0,n.jsx)(t.pre,{className:`shiki shiki-themes github-light github-dark`,style:{"--shiki-light":`#24292e`,"--shiki-dark":`#e1e4e8`,"--shiki-light-bg":`#fff`,"--shiki-dark-bg":`#24292e`},tabIndex:`0`,icon:`<svg viewBox="0 0 24 24"><path d="M 6,1 C 4.354992,1 3,2.354992 3,4 v 16 c 0,1.645008 1.354992,3 3,3 h 12 c 1.645008,0 3,-1.354992 3,-3 V 8 7 A 1.0001,1.0001 0 0 0 20.707031,6.2929687 l -5,-5 A 1.0001,1.0001 0 0 0 15,1 h -1 z m 0,2 h 7 v 3 c 0,1.645008 1.354992,3 3,3 h 3 v 11 c 0,0.564129 -0.435871,1 -1,1 H 6 C 5.4358712,21 5,20.564129 5,20 V 4 C 5,3.4358712 5.4358712,3 6,3 Z M 15,3.4140625 18.585937,7 H 16 C 15.435871,7 15,6.5641288 15,6 Z" fill="currentColor" /></svg>`,children:(0,n.jsx)(t.code,{children:(0,n.jsx)(t.span,{className:`line`,children:(0,n.jsx)(t.span,{children:`string`})})})})}),`
`,(0,n.jsx)(t.p,{children:`Возвращает объединённый и нормализованный путь.`}),`
`,(0,n.jsx)(t.hr,{}),`
`,(0,n.jsx)(`span`,{id:`method_nameArgs`}),`
`,(0,n.jsx)(t.h3,{id:`nameargs`,children:`nameArgs`}),`
`,(0,n.jsx)(n.Fragment,{children:(0,n.jsx)(t.pre,{className:`shiki shiki-themes github-light github-dark`,style:{"--shiki-light":`#24292e`,"--shiki-dark":`#e1e4e8`,"--shiki-light-bg":`#fff`,"--shiki-dark-bg":`#24292e`},tabIndex:`0`,icon:`<svg viewBox="0 0 24 24"><path d="M 6,1 C 4.354992,1 3,2.354992 3,4 v 16 c 0,1.645008 1.354992,3 3,3 h 12 c 1.645008,0 3,-1.354992 3,-3 V 8 7 A 1.0001,1.0001 0 0 0 20.707031,6.2929687 l -5,-5 A 1.0001,1.0001 0 0 0 15,1 h -1 z m 0,2 h 7 v 3 c 0,1.645008 1.354992,3 3,3 h 3 v 11 c 0,0.564129 -0.435871,1 -1,1 H 6 C 5.4358712,21 5,20.564129 5,20 V 4 C 5,3.4358712 5.4358712,3 6,3 Z M 15,3.4140625 18.585937,7 H 16 C 15.435871,7 15,6.5641288 15,6 Z" fill="currentColor" /></svg>`,children:(0,n.jsx)(t.code,{children:(0,n.jsx)(t.span,{className:`line`,children:(0,n.jsx)(t.span,{children:`(deprecated) - static public nameArgs(array|null  args) : array`})})})})}),`
`,(0,n.jsx)(t.h5,{id:`краткое-содержание-13`,children:`Краткое содержание`}),`
`,(0,n.jsx)(t.p,{children:`Преобразует переданный массив в плоский массив ключ-значение, удаляя пустые значения.`}),`
`,(0,n.jsx)(t.h5,{id:`описание-12`,children:`Описание`}),`
`,(0,n.jsxs)(t.p,{children:[`Метод принимает массив (или null) и возвращает новый массив,
где все вложенные массивы разворачиваются в плоскую структуру.
Для элементов с числовыми ключами их значения назначаются в виде ключей и значений одновременно.
Пустые строки или `,(0,n.jsx)(t.code,{children:`null`}),` удаляются из итогового массива.`]}),`
`,(0,n.jsxs)(t.p,{children:[(0,n.jsx)(t.strong,{children:`Устарело`}),`
Устарело с версии PHP 8.1. Рекомендуется использовать альтернативные методы для работы с массивами.`]}),`
`,(0,n.jsx)(t.h5,{id:`свойства-11`,children:`Свойства:`}),`
`,(0,n.jsxs)(t.table,{children:[(0,n.jsx)(t.thead,{children:(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.th,{children:`Название`}),(0,n.jsx)(t.th,{children:`Тип`}),(0,n.jsx)(t.th,{children:`По умолчанию`})]})}),(0,n.jsx)(t.tbody,{children:(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.td,{children:(0,n.jsx)(t.strong,{children:`$args`})}),(0,n.jsx)(t.td,{children:`array|null`}),(0,n.jsx)(t.td,{})]})})]}),`
`,(0,n.jsx)(t.h5,{id:`ошибки-8`,children:`Ошибки:`}),`
`,(0,n.jsxs)(t.table,{children:[(0,n.jsx)(t.thead,{children:(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.th,{children:`Тип`}),(0,n.jsx)(t.th,{children:`Описание`})]})}),(0,n.jsx)(t.tbody,{children:(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.td,{children:`\\InvalidArgumentException`}),(0,n.jsx)(t.td,{children:`Если аргумент $args содержит некорректные данные.`})]})})]}),`
`,(0,n.jsx)(t.h5,{id:`возвращает-13`,children:`Возвращает:`}),`
`,(0,n.jsx)(n.Fragment,{children:(0,n.jsx)(t.pre,{className:`shiki shiki-themes github-light github-dark`,style:{"--shiki-light":`#24292e`,"--shiki-dark":`#e1e4e8`,"--shiki-light-bg":`#fff`,"--shiki-dark-bg":`#24292e`},tabIndex:`0`,icon:`<svg viewBox="0 0 24 24"><path d="M 6,1 C 4.354992,1 3,2.354992 3,4 v 16 c 0,1.645008 1.354992,3 3,3 h 12 c 1.645008,0 3,-1.354992 3,-3 V 8 7 A 1.0001,1.0001 0 0 0 20.707031,6.2929687 l -5,-5 A 1.0001,1.0001 0 0 0 15,1 h -1 z m 0,2 h 7 v 3 c 0,1.645008 1.354992,3 3,3 h 3 v 11 c 0,0.564129 -0.435871,1 -1,1 H 6 C 5.4358712,21 5,20.564129 5,20 V 4 C 5,3.4358712 5.4358712,3 6,3 Z M 15,3.4140625 18.585937,7 H 16 C 15.435871,7 15,6.5641288 15,6 Z" fill="currentColor" /></svg>`,children:(0,n.jsx)(t.code,{children:(0,n.jsx)(t.span,{className:`line`,children:(0,n.jsx)(t.span,{children:`array`})})})})}),`
`,(0,n.jsxs)(t.p,{children:[`Плоский массив ключ-значение, где пустые строки и `,(0,n.jsx)(t.code,{children:`null`}),` исключены.`]}),`
`,(0,n.jsx)(t.hr,{}),`
`,(0,n.jsx)(`span`,{id:`method_normalizePath`}),`
`,(0,n.jsx)(t.h3,{id:`normalizepath`,children:`normalizePath`}),`
`,(0,n.jsx)(n.Fragment,{children:(0,n.jsx)(t.pre,{className:`shiki shiki-themes github-light github-dark`,style:{"--shiki-light":`#24292e`,"--shiki-dark":`#e1e4e8`,"--shiki-light-bg":`#fff`,"--shiki-dark-bg":`#24292e`},tabIndex:`0`,icon:`<svg viewBox="0 0 24 24"><path d="M 6,1 C 4.354992,1 3,2.354992 3,4 v 16 c 0,1.645008 1.354992,3 3,3 h 12 c 1.645008,0 3,-1.354992 3,-3 V 8 7 A 1.0001,1.0001 0 0 0 20.707031,6.2929687 l -5,-5 A 1.0001,1.0001 0 0 0 15,1 h -1 z m 0,2 h 7 v 3 c 0,1.645008 1.354992,3 3,3 h 3 v 11 c 0,0.564129 -0.435871,1 -1,1 H 6 C 5.4358712,21 5,20.564129 5,20 V 4 C 5,3.4358712 5.4358712,3 6,3 Z M 15,3.4140625 18.585937,7 H 16 C 15.435871,7 15,6.5641288 15,6 Z" fill="currentColor" /></svg>`,children:(0,n.jsx)(t.code,{children:(0,n.jsx)(t.span,{className:`line`,children:(0,n.jsx)(t.span,{children:`static public normalizePath(string  path) : string`})})})})}),`
`,(0,n.jsx)(t.h5,{id:`краткое-содержание-14`,children:`Краткое содержание`}),`
`,(0,n.jsx)(t.p,{children:`Нормализует путь, очищая его от лишних управляющих символов, точек и других нежелательных элементов.`}),`
`,(0,n.jsx)(t.h5,{id:`описание-13`,children:`Описание`}),`
`,(0,n.jsx)(t.p,{children:`Эта функция:`}),`
`,(0,n.jsxs)(t.ul,{children:[`
`,(0,n.jsxs)(t.li,{children:[`Удаляет управляющие символы и преобразует все обратные слэши (`,(0,n.jsx)(t.code,{children:`\\`}),`) в прямые (`,(0,n.jsx)(t.code,{children:`/`}),`).`]}),`
`,(0,n.jsxs)(t.li,{children:[`Убирает текущую (`,(0,n.jsx)(t.code,{children:`.`}),`) и родительскую (`,(0,n.jsx)(t.code,{children:`..`}),`) директории из пути.`]}),`
`,(0,n.jsx)(t.li,{children:`Удаляет корневой каталог (ROOT_DIR), если путь начинается с него.`}),`
`,(0,n.jsxs)(t.li,{children:[`Гарантирует, что путь на Linux начинается с символа `,(0,n.jsx)(t.code,{children:`/`}),`.`]}),`
`]}),`
`,(0,n.jsx)(t.h5,{id:`свойства-12`,children:`Свойства:`}),`
`,(0,n.jsxs)(t.table,{children:[(0,n.jsx)(t.thead,{children:(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.th,{children:`Название`}),(0,n.jsx)(t.th,{children:`Тип`}),(0,n.jsx)(t.th,{children:`По умолчанию`})]})}),(0,n.jsx)(t.tbody,{children:(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.td,{children:(0,n.jsx)(t.strong,{children:`$path`})}),(0,n.jsx)(t.td,{children:`string`}),(0,n.jsx)(t.td,{})]})})]}),`
`,(0,n.jsx)(t.h5,{id:`ошибки-9`,children:`Ошибки:`}),`
`,(0,n.jsxs)(t.table,{children:[(0,n.jsx)(t.thead,{children:(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.th,{children:`Тип`}),(0,n.jsx)(t.th,{children:`Описание`})]})}),(0,n.jsx)(t.tbody,{children:(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.td,{children:`\\InvalidArgumentException`}),(0,n.jsx)(t.td,{children:`Если константа ROOT_DIR не определена или имеет недопустимый тип.`})]})})]}),`
`,(0,n.jsx)(t.h5,{id:`возвращает-14`,children:`Возвращает:`}),`
`,(0,n.jsx)(n.Fragment,{children:(0,n.jsx)(t.pre,{className:`shiki shiki-themes github-light github-dark`,style:{"--shiki-light":`#24292e`,"--shiki-dark":`#e1e4e8`,"--shiki-light-bg":`#fff`,"--shiki-dark-bg":`#24292e`},tabIndex:`0`,icon:`<svg viewBox="0 0 24 24"><path d="M 6,1 C 4.354992,1 3,2.354992 3,4 v 16 c 0,1.645008 1.354992,3 3,3 h 12 c 1.645008,0 3,-1.354992 3,-3 V 8 7 A 1.0001,1.0001 0 0 0 20.707031,6.2929687 l -5,-5 A 1.0001,1.0001 0 0 0 15,1 h -1 z m 0,2 h 7 v 3 c 0,1.645008 1.354992,3 3,3 h 3 v 11 c 0,0.564129 -0.435871,1 -1,1 H 6 C 5.4358712,21 5,20.564129 5,20 V 4 C 5,3.4358712 5.4358712,3 6,3 Z M 15,3.4140625 18.585937,7 H 16 C 15.435871,7 15,6.5641288 15,6 Z" fill="currentColor" /></svg>`,children:(0,n.jsx)(t.code,{children:(0,n.jsx)(t.span,{className:`line`,children:(0,n.jsx)(t.span,{children:`string`})})})})}),`
`,(0,n.jsx)(t.p,{children:`Нормализованный путь.
Возвращается пустая строка, если входной путь содержит недопустимые символы (например, управляющие символы).`}),`
`,(0,n.jsx)(t.hr,{}),`
`,(0,n.jsx)(`span`,{id:`method_normalizeUrl`}),`
`,(0,n.jsx)(t.h3,{id:`normalizeurl`,children:`normalizeUrl`}),`
`,(0,n.jsx)(n.Fragment,{children:(0,n.jsx)(t.pre,{className:`shiki shiki-themes github-light github-dark`,style:{"--shiki-light":`#24292e`,"--shiki-dark":`#e1e4e8`,"--shiki-light-bg":`#fff`,"--shiki-dark-bg":`#24292e`},tabIndex:`0`,icon:`<svg viewBox="0 0 24 24"><path d="M 6,1 C 4.354992,1 3,2.354992 3,4 v 16 c 0,1.645008 1.354992,3 3,3 h 12 c 1.645008,0 3,-1.354992 3,-3 V 8 7 A 1.0001,1.0001 0 0 0 20.707031,6.2929687 l -5,-5 A 1.0001,1.0001 0 0 0 15,1 h -1 z m 0,2 h 7 v 3 c 0,1.645008 1.354992,3 3,3 h 3 v 11 c 0,0.564129 -0.435871,1 -1,1 H 6 C 5.4358712,21 5,20.564129 5,20 V 4 C 5,3.4358712 5.4358712,3 6,3 Z M 15,3.4140625 18.585937,7 H 16 C 15.435871,7 15,6.5641288 15,6 Z" fill="currentColor" /></svg>`,children:(0,n.jsx)(t.code,{children:(0,n.jsx)(t.span,{className:`line`,children:(0,n.jsx)(t.span,{children:`static public normalizeUrl(string  url, array  additionalQuery = []) : string`})})})})}),`
`,(0,n.jsx)(t.h5,{id:`краткое-содержание-15`,children:`Краткое содержание`}),`
`,(0,n.jsx)(t.p,{children:`Нормализует указанный URL, добавляя дополнительные параметры запроса при необходимости.`}),`
`,(0,n.jsx)(t.h5,{id:`описание-14`,children:`Описание`}),`
`,(0,n.jsxs)(t.p,{children:[`Если URL содержит схему или начинается с двойного слэша, возвращается исходный URL без изменений.
Если URL не содержит схему, добавляется базовый URL, который формируется на основе конфигурации `,(0,n.jsx)(t.code,{children:`$config`}),`.
Если путь в URL является относительным, он также дополняется базовым URL.`]}),`
`,(0,n.jsx)(t.h5,{id:`свойства-13`,children:`Свойства:`}),`
`,(0,n.jsxs)(t.table,{children:[(0,n.jsx)(t.thead,{children:(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.th,{children:`Название`}),(0,n.jsx)(t.th,{children:`Тип`}),(0,n.jsx)(t.th,{children:`По умолчанию`})]})}),(0,n.jsxs)(t.tbody,{children:[(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.td,{children:(0,n.jsx)(t.strong,{children:`$url`})}),(0,n.jsx)(t.td,{children:`string`}),(0,n.jsx)(t.td,{})]}),(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.td,{children:(0,n.jsx)(t.strong,{children:`$additionalQuery`})}),(0,n.jsx)(t.td,{children:`array`}),(0,n.jsx)(t.td,{children:`[]`})]})]})]}),`
`,(0,n.jsx)(t.h5,{id:`возвращает-15`,children:`Возвращает:`}),`
`,(0,n.jsx)(n.Fragment,{children:(0,n.jsx)(t.pre,{className:`shiki shiki-themes github-light github-dark`,style:{"--shiki-light":`#24292e`,"--shiki-dark":`#e1e4e8`,"--shiki-light-bg":`#fff`,"--shiki-dark-bg":`#24292e`},tabIndex:`0`,icon:`<svg viewBox="0 0 24 24"><path d="M 6,1 C 4.354992,1 3,2.354992 3,4 v 16 c 0,1.645008 1.354992,3 3,3 h 12 c 1.645008,0 3,-1.354992 3,-3 V 8 7 A 1.0001,1.0001 0 0 0 20.707031,6.2929687 l -5,-5 A 1.0001,1.0001 0 0 0 15,1 h -1 z m 0,2 h 7 v 3 c 0,1.645008 1.354992,3 3,3 h 3 v 11 c 0,0.564129 -0.435871,1 -1,1 H 6 C 5.4358712,21 5,20.564129 5,20 V 4 C 5,3.4358712 5.4358712,3 6,3 Z M 15,3.4140625 18.585937,7 H 16 C 15.435871,7 15,6.5641288 15,6 Z" fill="currentColor" /></svg>`,children:(0,n.jsx)(t.code,{children:(0,n.jsx)(t.span,{className:`line`,children:(0,n.jsx)(t.span,{children:`string`})})})})}),`
`,(0,n.jsx)(t.p,{children:`Нормализованный URL.`}),`
`,(0,n.jsx)(t.hr,{}),`
`,(0,n.jsx)(`span`,{id:`method_sanitizeArrayInput`}),`
`,(0,n.jsx)(t.h3,{id:`sanitizearrayinput`,children:`sanitizeArrayInput`}),`
`,(0,n.jsx)(n.Fragment,{children:(0,n.jsx)(t.pre,{className:`shiki shiki-themes github-light github-dark`,style:{"--shiki-light":`#24292e`,"--shiki-dark":`#e1e4e8`,"--shiki-light-bg":`#fff`,"--shiki-dark-bg":`#24292e`},tabIndex:`0`,icon:`<svg viewBox="0 0 24 24"><path d="M 6,1 C 4.354992,1 3,2.354992 3,4 v 16 c 0,1.645008 1.354992,3 3,3 h 12 c 1.645008,0 3,-1.354992 3,-3 V 8 7 A 1.0001,1.0001 0 0 0 20.707031,6.2929687 l -5,-5 A 1.0001,1.0001 0 0 0 15,1 h -1 z m 0,2 h 7 v 3 c 0,1.645008 1.354992,3 3,3 h 3 v 11 c 0,0.564129 -0.435871,1 -1,1 H 6 C 5.4358712,21 5,20.564129 5,20 V 4 C 5,3.4358712 5.4358712,3 6,3 Z M 15,3.4140625 18.585937,7 H 16 C 15.435871,7 15,6.5641288 15,6 Z" fill="currentColor" /></svg>`,children:(0,n.jsx)(t.code,{children:(0,n.jsx)(t.span,{className:`line`,children:(0,n.jsx)(t.span,{children:`static public sanitizeArrayInput(mixed  input = null, array|null  flags = null) : mixed`})})})})}),`
`,(0,n.jsx)(t.h5,{id:`краткое-содержание-16`,children:`Краткое содержание`}),`
`,(0,n.jsx)(t.p,{children:`Очищает входные данные, массивы или значения, используя заданные флаги для фильтрации.`}),`
`,(0,n.jsx)(t.h5,{id:`описание-15`,children:`Описание`}),`
`,(0,n.jsx)(t.p,{children:`Если входные данные являются массивом, рекурсивно применяется функция очистки ко всем элементам массива.
Если входные данные - одно значение, применяется очистка непосредственно к нему.`}),`
`,(0,n.jsx)(t.h5,{id:`свойства-14`,children:`Свойства:`}),`
`,(0,n.jsxs)(t.table,{children:[(0,n.jsx)(t.thead,{children:(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.th,{children:`Название`}),(0,n.jsx)(t.th,{children:`Тип`}),(0,n.jsx)(t.th,{children:`По умолчанию`})]})}),(0,n.jsxs)(t.tbody,{children:[(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.td,{children:(0,n.jsx)(t.strong,{children:`$input`})}),(0,n.jsx)(t.td,{children:`mixed`}),(0,n.jsx)(t.td,{children:`null`})]}),(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.td,{children:(0,n.jsx)(t.strong,{children:`$flags`})}),(0,n.jsx)(t.td,{children:`array|null`}),(0,n.jsx)(t.td,{children:`null`})]})]})]}),`
`,(0,n.jsx)(t.h5,{id:`возвращает-16`,children:`Возвращает:`}),`
`,(0,n.jsx)(n.Fragment,{children:(0,n.jsx)(t.pre,{className:`shiki shiki-themes github-light github-dark`,style:{"--shiki-light":`#24292e`,"--shiki-dark":`#e1e4e8`,"--shiki-light-bg":`#fff`,"--shiki-dark-bg":`#24292e`},tabIndex:`0`,icon:`<svg viewBox="0 0 24 24"><path d="M 6,1 C 4.354992,1 3,2.354992 3,4 v 16 c 0,1.645008 1.354992,3 3,3 h 12 c 1.645008,0 3,-1.354992 3,-3 V 8 7 A 1.0001,1.0001 0 0 0 20.707031,6.2929687 l -5,-5 A 1.0001,1.0001 0 0 0 15,1 h -1 z m 0,2 h 7 v 3 c 0,1.645008 1.354992,3 3,3 h 3 v 11 c 0,0.564129 -0.435871,1 -1,1 H 6 C 5.4358712,21 5,20.564129 5,20 V 4 C 5,3.4358712 5.4358712,3 6,3 Z M 15,3.4140625 18.585937,7 H 16 C 15.435871,7 15,6.5641288 15,6 Z" fill="currentColor" /></svg>`,children:(0,n.jsx)(t.code,{children:(0,n.jsx)(t.span,{className:`line`,children:(0,n.jsx)(t.span,{children:`mixed`})})})})}),`
`,(0,n.jsx)(t.p,{children:`Очищенные данные. Если входные данные - массив, возвращается очищенный массив. Если данные не
заданы, возвращается null.`}),`
`,(0,n.jsx)(t.hr,{}),`
`,(0,n.jsx)(`span`,{id:`method_sanitizeInput`}),`
`,(0,n.jsx)(t.h3,{id:`sanitizeinput`,children:`sanitizeInput`}),`
`,(0,n.jsx)(n.Fragment,{children:(0,n.jsx)(t.pre,{className:`shiki shiki-themes github-light github-dark`,style:{"--shiki-light":`#24292e`,"--shiki-dark":`#e1e4e8`,"--shiki-light-bg":`#fff`,"--shiki-dark-bg":`#24292e`},tabIndex:`0`,icon:`<svg viewBox="0 0 24 24"><path d="M 6,1 C 4.354992,1 3,2.354992 3,4 v 16 c 0,1.645008 1.354992,3 3,3 h 12 c 1.645008,0 3,-1.354992 3,-3 V 8 7 A 1.0001,1.0001 0 0 0 20.707031,6.2929687 l -5,-5 A 1.0001,1.0001 0 0 0 15,1 h -1 z m 0,2 h 7 v 3 c 0,1.645008 1.354992,3 3,3 h 3 v 11 c 0,0.564129 -0.435871,1 -1,1 H 6 C 5.4358712,21 5,20.564129 5,20 V 4 C 5,3.4358712 5.4358712,3 6,3 Z M 15,3.4140625 18.585937,7 H 16 C 15.435871,7 15,6.5641288 15,6 Z" fill="currentColor" /></svg>`,children:(0,n.jsx)(t.code,{children:(0,n.jsx)(t.span,{className:`line`,children:(0,n.jsx)(t.span,{children:`static public sanitizeInput(mixed|null  value = null, array|null  flags = null) : string|null`})})})})}),`
`,(0,n.jsx)(t.h5,{id:`краткое-содержание-17`,children:`Краткое содержание`}),`
`,(0,n.jsx)(t.p,{children:`Обрабатывает и фильтрует входящее значение на основе заданных флагов.`}),`
`,(0,n.jsx)(t.h5,{id:`описание-16`,children:`Описание`}),`
`,(0,n.jsxs)(t.p,{children:[`Эта функция принимает значение и массив флагов фильтрации, которые применяются
к значению последовательно, используя функцию `,(0,n.jsx)(t.code,{children:`filter_var`}),`.`]}),`
`,(0,n.jsx)(t.h5,{id:`свойства-15`,children:`Свойства:`}),`
`,(0,n.jsxs)(t.table,{children:[(0,n.jsx)(t.thead,{children:(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.th,{children:`Название`}),(0,n.jsx)(t.th,{children:`Тип`}),(0,n.jsx)(t.th,{children:`По умолчанию`})]})}),(0,n.jsxs)(t.tbody,{children:[(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.td,{children:(0,n.jsx)(t.strong,{children:`$value`})}),(0,n.jsx)(t.td,{children:`mixed|null`}),(0,n.jsx)(t.td,{children:`null`})]}),(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.td,{children:(0,n.jsx)(t.strong,{children:`$flags`})}),(0,n.jsx)(t.td,{children:`array|null`}),(0,n.jsx)(t.td,{children:`null`})]})]})]}),`
`,(0,n.jsx)(t.h5,{id:`возвращает-17`,children:`Возвращает:`}),`
`,(0,n.jsx)(n.Fragment,{children:(0,n.jsx)(t.pre,{className:`shiki shiki-themes github-light github-dark`,style:{"--shiki-light":`#24292e`,"--shiki-dark":`#e1e4e8`,"--shiki-light-bg":`#fff`,"--shiki-dark-bg":`#24292e`},tabIndex:`0`,icon:`<svg viewBox="0 0 24 24"><path d="M 6,1 C 4.354992,1 3,2.354992 3,4 v 16 c 0,1.645008 1.354992,3 3,3 h 12 c 1.645008,0 3,-1.354992 3,-3 V 8 7 A 1.0001,1.0001 0 0 0 20.707031,6.2929687 l -5,-5 A 1.0001,1.0001 0 0 0 15,1 h -1 z m 0,2 h 7 v 3 c 0,1.645008 1.354992,3 3,3 h 3 v 11 c 0,0.564129 -0.435871,1 -1,1 H 6 C 5.4358712,21 5,20.564129 5,20 V 4 C 5,3.4358712 5.4358712,3 6,3 Z M 15,3.4140625 18.585937,7 H 16 C 15.435871,7 15,6.5641288 15,6 Z" fill="currentColor" /></svg>`,children:(0,n.jsx)(t.code,{children:(0,n.jsx)(t.span,{className:`line`,children:(0,n.jsx)(t.span,{children:`string|null`})})})})}),`
`,(0,n.jsxs)(t.p,{children:[`Возвращает отфильтрованное значение в виде строки или `,(0,n.jsx)(t.code,{children:`null`}),` в случае, если
значение или фильтрация недействительны.`]}),`
`,(0,n.jsx)(t.hr,{}),`
`,(0,n.jsx)(`span`,{id:`method_setDb`}),`
`,(0,n.jsx)(t.h3,{id:`setdb`,children:`setDb`}),`
`,(0,n.jsx)(n.Fragment,{children:(0,n.jsx)(t.pre,{className:`shiki shiki-themes github-light github-dark`,style:{"--shiki-light":`#24292e`,"--shiki-dark":`#e1e4e8`,"--shiki-light-bg":`#fff`,"--shiki-dark-bg":`#24292e`},tabIndex:`0`,icon:`<svg viewBox="0 0 24 24"><path d="M 6,1 C 4.354992,1 3,2.354992 3,4 v 16 c 0,1.645008 1.354992,3 3,3 h 12 c 1.645008,0 3,-1.354992 3,-3 V 8 7 A 1.0001,1.0001 0 0 0 20.707031,6.2929687 l -5,-5 A 1.0001,1.0001 0 0 0 15,1 h -1 z m 0,2 h 7 v 3 c 0,1.645008 1.354992,3 3,3 h 3 v 11 c 0,0.564129 -0.435871,1 -1,1 H 6 C 5.4358712,21 5,20.564129 5,20 V 4 C 5,3.4358712 5.4358712,3 6,3 Z M 15,3.4140625 18.585937,7 H 16 C 15.435871,7 15,6.5641288 15,6 Z" fill="currentColor" /></svg>`,children:(0,n.jsx)(t.code,{children:(0,n.jsx)(t.span,{className:`line`,children:(0,n.jsx)(t.span,{children:`static public setDb(\\db|null  db) : void`})})})})}),`
`,(0,n.jsx)(t.h5,{id:`краткое-содержание-18`,children:`Краткое содержание`}),`
`,(0,n.jsx)(t.p,{children:`Устанавливает экземпляр базы данных.`}),`
`,(0,n.jsx)(t.h5,{id:`описание-17`,children:`Описание`}),`
`,(0,n.jsx)(t.p,{children:`Метод задает объект базы данных, который будет использоваться в дальнейшем.`}),`
`,(0,n.jsx)(t.h5,{id:`смотри-так-же-4`,children:`Смотри так-же:`}),`
`,(0,n.jsxs)(t.ul,{children:[`
`,(0,n.jsx)(t.li,{children:(0,n.jsx)(t.a,{href:`#property_db`,children:`\\DataManager::$db`})}),`
`]}),`
`,(0,n.jsx)(t.h5,{id:`свойства-16`,children:`Свойства:`}),`
`,(0,n.jsxs)(t.table,{children:[(0,n.jsx)(t.thead,{children:(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.th,{children:`Название`}),(0,n.jsx)(t.th,{children:`Тип`}),(0,n.jsx)(t.th,{children:`По умолчанию`})]})}),(0,n.jsx)(t.tbody,{children:(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.td,{children:(0,n.jsx)(t.strong,{children:`$db`})}),(0,n.jsx)(t.td,{children:`\\db|null`}),(0,n.jsx)(t.td,{})]})})]}),`
`,(0,n.jsx)(t.h5,{id:`возвращает-18`,children:`Возвращает:`}),`
`,(0,n.jsx)(n.Fragment,{children:(0,n.jsx)(t.pre,{className:`shiki shiki-themes github-light github-dark`,style:{"--shiki-light":`#24292e`,"--shiki-dark":`#e1e4e8`,"--shiki-light-bg":`#fff`,"--shiki-dark-bg":`#24292e`},tabIndex:`0`,icon:`<svg viewBox="0 0 24 24"><path d="M 6,1 C 4.354992,1 3,2.354992 3,4 v 16 c 0,1.645008 1.354992,3 3,3 h 12 c 1.645008,0 3,-1.354992 3,-3 V 8 7 A 1.0001,1.0001 0 0 0 20.707031,6.2929687 l -5,-5 A 1.0001,1.0001 0 0 0 15,1 h -1 z m 0,2 h 7 v 3 c 0,1.645008 1.354992,3 3,3 h 3 v 11 c 0,0.564129 -0.435871,1 -1,1 H 6 C 5.4358712,21 5,20.564129 5,20 V 4 C 5,3.4358712 5.4358712,3 6,3 Z M 15,3.4140625 18.585937,7 H 16 C 15.435871,7 15,6.5641288 15,6 Z" fill="currentColor" /></svg>`,children:(0,n.jsx)(t.code,{children:(0,n.jsx)(t.span,{className:`line`,children:(0,n.jsx)(t.span,{children:`void`})})})})}),`
`,(0,n.jsx)(t.hr,{}),`
`,(0,n.jsx)(`span`,{id:`method_toTranslit`}),`
`,(0,n.jsx)(t.h3,{id:`totranslit`,children:`toTranslit`}),`
`,(0,n.jsx)(n.Fragment,{children:(0,n.jsx)(t.pre,{className:`shiki shiki-themes github-light github-dark`,style:{"--shiki-light":`#24292e`,"--shiki-dark":`#e1e4e8`,"--shiki-light-bg":`#fff`,"--shiki-dark-bg":`#24292e`},tabIndex:`0`,icon:`<svg viewBox="0 0 24 24"><path d="M 6,1 C 4.354992,1 3,2.354992 3,4 v 16 c 0,1.645008 1.354992,3 3,3 h 12 c 1.645008,0 3,-1.354992 3,-3 V 8 7 A 1.0001,1.0001 0 0 0 20.707031,6.2929687 l -5,-5 A 1.0001,1.0001 0 0 0 15,1 h -1 z m 0,2 h 7 v 3 c 0,1.645008 1.354992,3 3,3 h 3 v 11 c 0,0.564129 -0.435871,1 -1,1 H 6 C 5.4358712,21 5,20.564129 5,20 V 4 C 5,3.4358712 5.4358712,3 6,3 Z M 15,3.4140625 18.585937,7 H 16 C 15.435871,7 15,6.5641288 15,6 Z" fill="currentColor" /></svg>`,children:(0,n.jsx)(t.code,{children:(0,n.jsx)(t.span,{className:`line`,children:(0,n.jsx)(t.span,{children:`static public toTranslit(string  input, bool  lowercase = true) : string`})})})})}),`
`,(0,n.jsx)(t.h5,{id:`краткое-содержание-19`,children:`Краткое содержание`}),`
`,(0,n.jsx)(t.p,{children:`Конвертирует строку в транслитерацию, форматирует её и удаляет нежелательные символы.`}),`
`,(0,n.jsx)(t.h5,{id:`описание-18`,children:`Описание`}),`
`,(0,n.jsx)(t.p,{children:`Эта функция выполняет трансформацию текста с учетом заданного функционала:`}),`
`,(0,n.jsxs)(t.ul,{children:[`
`,(0,n.jsxs)(t.li,{children:[`Преобразует строку в транслит с использованием Transliterator или функции `,(0,n.jsx)(t.code,{children:`totranslit()`}),`,
если Transliterator недоступен.`]}),`
`,(0,n.jsx)(t.li,{children:`Удаляет все символы, кроме букв, цифр и пробелов.`}),`
`,(0,n.jsx)(t.li,{children:`Заменяет пробелы на символы подчеркивания.`}),`
`,(0,n.jsx)(t.li,{children:`Приводит строку к нижнему регистру.`}),`
`]}),`
`,(0,n.jsx)(t.p,{children:`Функция упрощает создание URL-совместимых или SEO-оптимизированных строк из произвольных
текстовых данных.`}),`
`,(0,n.jsx)(t.h5,{id:`свойства-17`,children:`Свойства:`}),`
`,(0,n.jsxs)(t.table,{children:[(0,n.jsx)(t.thead,{children:(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.th,{children:`Название`}),(0,n.jsx)(t.th,{children:`Тип`}),(0,n.jsx)(t.th,{children:`По умолчанию`})]})}),(0,n.jsxs)(t.tbody,{children:[(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.td,{children:(0,n.jsx)(t.strong,{children:`$input`})}),(0,n.jsx)(t.td,{children:`string`}),(0,n.jsx)(t.td,{})]}),(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.td,{children:(0,n.jsx)(t.strong,{children:`$lowercase`})}),(0,n.jsx)(t.td,{children:`bool`}),(0,n.jsx)(t.td,{children:`true`})]})]})]}),`
`,(0,n.jsx)(t.h5,{id:`ошибки-10`,children:`Ошибки:`}),`
`,(0,n.jsxs)(t.table,{children:[(0,n.jsx)(t.thead,{children:(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.th,{children:`Тип`}),(0,n.jsx)(t.th,{children:`Описание`})]})}),(0,n.jsx)(t.tbody,{children:(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.td,{children:`\\RuntimeException`}),(0,n.jsx)(t.td,{children:`Если ни один из механизмов транслитерации, Transliterator или totranslit, недоступен или некорректен.`})]})})]}),`
`,(0,n.jsx)(t.h5,{id:`возвращает-19`,children:`Возвращает:`}),`
`,(0,n.jsx)(n.Fragment,{children:(0,n.jsx)(t.pre,{className:`shiki shiki-themes github-light github-dark`,style:{"--shiki-light":`#24292e`,"--shiki-dark":`#e1e4e8`,"--shiki-light-bg":`#fff`,"--shiki-dark-bg":`#24292e`},tabIndex:`0`,icon:`<svg viewBox="0 0 24 24"><path d="M 6,1 C 4.354992,1 3,2.354992 3,4 v 16 c 0,1.645008 1.354992,3 3,3 h 12 c 1.645008,0 3,-1.354992 3,-3 V 8 7 A 1.0001,1.0001 0 0 0 20.707031,6.2929687 l -5,-5 A 1.0001,1.0001 0 0 0 15,1 h -1 z m 0,2 h 7 v 3 c 0,1.645008 1.354992,3 3,3 h 3 v 11 c 0,0.564129 -0.435871,1 -1,1 H 6 C 5.4358712,21 5,20.564129 5,20 V 4 C 5,3.4358712 5.4358712,3 6,3 Z M 15,3.4140625 18.585937,7 H 16 C 15.435871,7 15,6.5641288 15,6 Z" fill="currentColor" /></svg>`,children:(0,n.jsx)(t.code,{children:(0,n.jsx)(t.span,{className:`line`,children:(0,n.jsx)(t.span,{children:`string`})})})})}),`
`,(0,n.jsx)(t.p,{children:`Отформатированная строка, приведенная к нижнему регистру, состоящая из
символов латиницы, цифр и подчеркиваний.`}),`
`,(0,n.jsx)(t.hr,{}),`
`,(0,n.jsx)(`span`,{id:`method_loadJsonConfig`}),`
`,(0,n.jsx)(t.h3,{id:`loadjsonconfig`,children:`loadJsonConfig`}),`
`,(0,n.jsx)(n.Fragment,{children:(0,n.jsx)(t.pre,{className:`shiki shiki-themes github-light github-dark`,style:{"--shiki-light":`#24292e`,"--shiki-dark":`#e1e4e8`,"--shiki-light-bg":`#fff`,"--shiki-dark-bg":`#24292e`},tabIndex:`0`,icon:`<svg viewBox="0 0 24 24"><path d="M 6,1 C 4.354992,1 3,2.354992 3,4 v 16 c 0,1.645008 1.354992,3 3,3 h 12 c 1.645008,0 3,-1.354992 3,-3 V 8 7 A 1.0001,1.0001 0 0 0 20.707031,6.2929687 l -5,-5 A 1.0001,1.0001 0 0 0 15,1 h -1 z m 0,2 h 7 v 3 c 0,1.645008 1.354992,3 3,3 h 3 v 11 c 0,0.564129 -0.435871,1 -1,1 H 6 C 5.4358712,21 5,20.564129 5,20 V 4 C 5,3.4358712 5.4358712,3 6,3 Z M 15,3.4140625 18.585937,7 H 16 C 15.435871,7 15,6.5641288 15,6 Z" fill="currentColor" /></svg>`,children:(0,n.jsx)(t.code,{children:(0,n.jsx)(t.span,{className:`line`,children:(0,n.jsx)(t.span,{children:`static private loadJsonConfig(string  filePath) : array`})})})})}),`
`,(0,n.jsx)(t.h5,{id:`краткое-содержание-20`,children:`Краткое содержание`}),`
`,(0,n.jsx)(t.p,{children:`Загружает JSON-конфигурацию из указанного файла и возвращает её в виде массива.`}),`
`,(0,n.jsx)(t.h5,{id:`описание-19`,children:`Описание`}),`
`,(0,n.jsxs)(t.p,{children:[`Функция читает содержимое файла, парсит его как JSON и возвращает массив данных.
Если элементы данных не являются массивами, они проходят фильтрацию с использованием
`,(0,n.jsx)(t.code,{children:`FILTER_SANITIZE_FULL_SPECIAL_CHARS`}),`.`]}),`
`,(0,n.jsx)(t.h5,{id:`свойства-18`,children:`Свойства:`}),`
`,(0,n.jsxs)(t.table,{children:[(0,n.jsx)(t.thead,{children:(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.th,{children:`Название`}),(0,n.jsx)(t.th,{children:`Тип`}),(0,n.jsx)(t.th,{children:`По умолчанию`})]})}),(0,n.jsx)(t.tbody,{children:(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.td,{children:(0,n.jsx)(t.strong,{children:`$filePath`})}),(0,n.jsx)(t.td,{children:`string`}),(0,n.jsx)(t.td,{})]})})]}),`
`,(0,n.jsx)(t.h5,{id:`ошибки-11`,children:`Ошибки:`}),`
`,(0,n.jsxs)(t.table,{children:[(0,n.jsx)(t.thead,{children:(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.th,{children:`Тип`}),(0,n.jsx)(t.th,{children:`Описание`})]})}),(0,n.jsxs)(t.tbody,{children:[(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.td,{children:`\\JsonException`}),(0,n.jsx)(t.td,{children:`Если произошла ошибка при парсинге JSON.`})]}),(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.td,{children:`\\RuntimeException`}),(0,n.jsx)(t.td,{children:`Если файл не существует или недоступен для чтения.`})]})]})]}),`
`,(0,n.jsx)(t.h5,{id:`возвращает-20`,children:`Возвращает:`}),`
`,(0,n.jsx)(n.Fragment,{children:(0,n.jsx)(t.pre,{className:`shiki shiki-themes github-light github-dark`,style:{"--shiki-light":`#24292e`,"--shiki-dark":`#e1e4e8`,"--shiki-light-bg":`#fff`,"--shiki-dark-bg":`#24292e`},tabIndex:`0`,icon:`<svg viewBox="0 0 24 24"><path d="M 6,1 C 4.354992,1 3,2.354992 3,4 v 16 c 0,1.645008 1.354992,3 3,3 h 12 c 1.645008,0 3,-1.354992 3,-3 V 8 7 A 1.0001,1.0001 0 0 0 20.707031,6.2929687 l -5,-5 A 1.0001,1.0001 0 0 0 15,1 h -1 z m 0,2 h 7 v 3 c 0,1.645008 1.354992,3 3,3 h 3 v 11 c 0,0.564129 -0.435871,1 -1,1 H 6 C 5.4358712,21 5,20.564129 5,20 V 4 C 5,3.4358712 5.4358712,3 6,3 Z M 15,3.4140625 18.585937,7 H 16 C 15.435871,7 15,6.5641288 15,6 Z" fill="currentColor" /></svg>`,children:(0,n.jsx)(t.code,{children:(0,n.jsx)(t.span,{className:`line`,children:(0,n.jsx)(t.span,{children:`array`})})})})}),`
`,(0,n.jsx)(t.p,{children:`Ассоциативный массив, содержащий данные из файла JSON.`}),`
`,(0,n.jsx)(t.hr,{}),`
`,(0,n.jsx)(`span`,{id:`method_migrateOldConfig`}),`
`,(0,n.jsx)(t.h3,{id:`migrateoldconfig`,children:`migrateOldConfig`}),`
`,(0,n.jsx)(n.Fragment,{children:(0,n.jsx)(t.pre,{className:`shiki shiki-themes github-light github-dark`,style:{"--shiki-light":`#24292e`,"--shiki-dark":`#e1e4e8`,"--shiki-light-bg":`#fff`,"--shiki-dark-bg":`#24292e`},tabIndex:`0`,icon:`<svg viewBox="0 0 24 24"><path d="M 6,1 C 4.354992,1 3,2.354992 3,4 v 16 c 0,1.645008 1.354992,3 3,3 h 12 c 1.645008,0 3,-1.354992 3,-3 V 8 7 A 1.0001,1.0001 0 0 0 20.707031,6.2929687 l -5,-5 A 1.0001,1.0001 0 0 0 15,1 h -1 z m 0,2 h 7 v 3 c 0,1.645008 1.354992,3 3,3 h 3 v 11 c 0,0.564129 -0.435871,1 -1,1 H 6 C 5.4358712,21 5,20.564129 5,20 V 4 C 5,3.4358712 5.4358712,3 6,3 Z M 15,3.4140625 18.585937,7 H 16 C 15.435871,7 15,6.5641288 15,6 Z" fill="currentColor" /></svg>`,children:(0,n.jsx)(t.code,{children:(0,n.jsx)(t.span,{className:`line`,children:(0,n.jsx)(t.span,{children:`static private migrateOldConfig(string  codename, string  confName, string  configPath) : array`})})})})}),`
`,(0,n.jsx)(t.h5,{id:`краткое-содержание-21`,children:`Краткое содержание`}),`
`,(0,n.jsx)(t.p,{children:`Мигрирует старый файл конфигурации в новый JSON-формат.`}),`
`,(0,n.jsx)(t.h5,{id:`описание-20`,children:`Описание`}),`
`,(0,n.jsx)(t.p,{children:`Функция проверяет наличие старого конфигурационного файла, преобразует его
содержимое в новый формат, сохраняет в указанной директории в формате JSON и
удаляет старый файл. Если файл отсутствует или содержит некорректный формат данных,
выполняются соответствующие обработки ошибок и возвращается пустой массив.`}),`
`,(0,n.jsx)(t.h5,{id:`смотри-так-же-5`,children:`Смотри так-же:`}),`
`,(0,n.jsxs)(t.ul,{children:[`
`,(0,n.jsx)(t.li,{children:(0,n.jsx)(t.a,{href:`./LogGenerator#method_generateLog`,children:`\\LogGenerator::generateLog()`})}),`
`]}),`
`,(0,n.jsx)(t.h5,{id:`свойства-19`,children:`Свойства:`}),`
`,(0,n.jsxs)(t.table,{children:[(0,n.jsx)(t.thead,{children:(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.th,{children:`Название`}),(0,n.jsx)(t.th,{children:`Тип`}),(0,n.jsx)(t.th,{children:`По умолчанию`})]})}),(0,n.jsxs)(t.tbody,{children:[(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.td,{children:(0,n.jsx)(t.strong,{children:`$codename`})}),(0,n.jsx)(t.td,{children:`string`}),(0,n.jsx)(t.td,{})]}),(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.td,{children:(0,n.jsx)(t.strong,{children:`$confName`})}),(0,n.jsx)(t.td,{children:`string`}),(0,n.jsx)(t.td,{})]}),(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.td,{children:(0,n.jsx)(t.strong,{children:`$configPath`})}),(0,n.jsx)(t.td,{children:`string`}),(0,n.jsx)(t.td,{})]})]})]}),`
`,(0,n.jsx)(t.h5,{id:`ошибки-12`,children:`Ошибки:`}),`
`,(0,n.jsxs)(t.table,{children:[(0,n.jsx)(t.thead,{children:(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.th,{children:`Тип`}),(0,n.jsx)(t.th,{children:`Описание`})]})}),(0,n.jsxs)(t.tbody,{children:[(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.td,{children:`\\JsonException`}),(0,n.jsx)(t.td,{children:`Если возникают ошибки при кодировании JSON.`})]}),(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.td,{children:`\\RuntimeException`}),(0,n.jsx)(t.td,{children:`Если не удается записать файл или выполнить операции с файловой системой.`})]}),(0,n.jsxs)(t.tr,{children:[(0,n.jsx)(t.td,{children:`\\Throwable`}),(0,n.jsx)(t.td,{})]})]})]}),`
`,(0,n.jsx)(t.h5,{id:`возвращает-21`,children:`Возвращает:`}),`
`,(0,n.jsx)(n.Fragment,{children:(0,n.jsx)(t.pre,{className:`shiki shiki-themes github-light github-dark`,style:{"--shiki-light":`#24292e`,"--shiki-dark":`#e1e4e8`,"--shiki-light-bg":`#fff`,"--shiki-dark-bg":`#24292e`},tabIndex:`0`,icon:`<svg viewBox="0 0 24 24"><path d="M 6,1 C 4.354992,1 3,2.354992 3,4 v 16 c 0,1.645008 1.354992,3 3,3 h 12 c 1.645008,0 3,-1.354992 3,-3 V 8 7 A 1.0001,1.0001 0 0 0 20.707031,6.2929687 l -5,-5 A 1.0001,1.0001 0 0 0 15,1 h -1 z m 0,2 h 7 v 3 c 0,1.645008 1.354992,3 3,3 h 3 v 11 c 0,0.564129 -0.435871,1 -1,1 H 6 C 5.4358712,21 5,20.564129 5,20 V 4 C 5,3.4358712 5.4358712,3 6,3 Z M 15,3.4140625 18.585937,7 H 16 C 15.435871,7 15,6.5641288 15,6 Z" fill="currentColor" /></svg>`,children:(0,n.jsx)(t.code,{children:(0,n.jsx)(t.span,{className:`line`,children:(0,n.jsx)(t.span,{children:`array`})})})})}),`
`,(0,n.jsx)(t.p,{children:`Вернет массив настроек, извлеченных из старого конфигурационного файла.`})]})}function l(e={}){let{wrapper:t}=e.components||{};return t?(0,n.jsx)(t,{...e,children:(0,n.jsx)(c,{...e})}):c(e)}export{a as _markdown,l as default,r as frontmatter,i as lastModified,o as structuredData,s as toc};