import{r as e}from"./rolldown-runtime-QTnfLwEv.js";import{t}from"./jsx-runtime-By8HlURe.js";var n=e(t()),r=`/assets/1650388445336-image-C9Iszx9F.png`,i=`/assets/1650388474904-image-BxCIWu99.png`,a=`/assets/1650388627064-image-6PQFCpBw.png`,o=`/assets/1650388899076-image-DK13rhJP.png`,s={title:`Создание запроса на тех. поддержку`,description:`Инструкция по созданию запроса на тех. поддержку.`},c=new Date(1787124777e3),l=`









К таким мерам пришлось прибегнуть из‑за того, что люди не любят читать. Чтобы упростить обращение, создан единый способ. Повторные вопросы в темах и ЛС будут игнорироваться.

## Статус тех. поддержки [#статус-тех-поддержки]

Следите за информацией в разделе «&#x2A;*[Общая информация](https://devcraft.club/forums/obschaja-informacija.5/)**».

## Создание тикета [#создание-тикета]

Начиная с 19.04.2022 на сайте существует система тикетов (обращений).

<img alt="image.png" src="__img0" /><img alt="image.png" src="__img1" />

Переходим в систему поддержки и нажимаем кнопку «Обратиться в службу поддержки».

Выбираем нужную категорию. Если нужна только техподдержка на платной основе — выбираем её, иначе — «Разработки».

<img alt="image.png" src="__img2" />

В форме заполняем все нужные поля, описываем проблему и нажимаем «Создать обращение».

## Альтернативный способ [#альтернативный-способ]

Переходим на страницу ресурса. Если у ресурса есть репозиторий на GitHub, появится соответствующая кнопка.

<img alt="image.png" src="__img3" />

## Третий способ [#третий-способ]

Только если первые два способа не сработали, задайте вопрос в теме обсуждения ресурса.
`,u={contents:[{heading:void 0,content:`К таким мерам пришлось прибегнуть из‑за того, что люди не любят читать. Чтобы упростить обращение, создан единый способ. Повторные вопросы в темах и ЛС будут игнорироваться.`},{heading:`статус-тех-поддержки`,content:`Следите за информацией в разделе «**Общая информация**».`},{heading:`создание-тикета`,content:`Начиная с 19.04.2022 на сайте существует система тикетов (обращений).`},{heading:`создание-тикета`,content:`Переходим в систему поддержки и нажимаем кнопку «Обратиться в службу поддержки».`},{heading:`создание-тикета`,content:`Выбираем нужную категорию. Если нужна только техподдержка на платной основе — выбираем её, иначе — «Разработки».`},{heading:`создание-тикета`,content:`В форме заполняем все нужные поля, описываем проблему и нажимаем «Создать обращение».`},{heading:`альтернативный-способ`,content:`Переходим на страницу ресурса. Если у ресурса есть репозиторий на GitHub, появится соответствующая кнопка.`},{heading:`третий-способ`,content:`Только если первые два способа не сработали, задайте вопрос в теме обсуждения ресурса.`}],headings:[{id:`статус-тех-поддержки`,content:`Статус тех. поддержки`},{id:`создание-тикета`,content:`Создание тикета`},{id:`альтернативный-способ`,content:`Альтернативный способ`},{id:`третий-способ`,content:`Третий способ`}]},d=[{depth:2,url:`#статус-тех-поддержки`,title:(0,n.jsx)(n.Fragment,{children:`Статус тех. поддержки`})},{depth:2,url:`#создание-тикета`,title:(0,n.jsx)(n.Fragment,{children:`Создание тикета`})},{depth:2,url:`#альтернативный-способ`,title:(0,n.jsx)(n.Fragment,{children:`Альтернативный способ`})},{depth:2,url:`#третий-способ`,title:(0,n.jsx)(n.Fragment,{children:`Третий способ`})}];function f(e){let t={a:`a`,h2:`h2`,img:`img`,p:`p`,strong:`strong`,...e.components};return(0,n.jsxs)(n.Fragment,{children:[(0,n.jsx)(t.p,{children:`К таким мерам пришлось прибегнуть из‑за того, что люди не любят читать. Чтобы упростить обращение, создан единый способ. Повторные вопросы в темах и ЛС будут игнорироваться.`}),`
`,(0,n.jsx)(t.h2,{id:`статус-тех-поддержки`,children:`Статус тех. поддержки`}),`
`,(0,n.jsxs)(t.p,{children:[`Следите за информацией в разделе «`,(0,n.jsx)(t.strong,{children:(0,n.jsx)(t.a,{href:`https://devcraft.club/forums/obschaja-informacija.5/`,children:`Общая информация`})}),`».`]}),`
`,(0,n.jsx)(t.h2,{id:`создание-тикета`,children:`Создание тикета`}),`
`,(0,n.jsx)(t.p,{children:`Начиная с 19.04.2022 на сайте существует система тикетов (обращений).`}),`
`,(0,n.jsxs)(t.p,{children:[(0,n.jsx)(t.img,{alt:`image.png`,src:r}),(0,n.jsx)(t.img,{alt:`image.png`,src:i})]}),`
`,(0,n.jsx)(t.p,{children:`Переходим в систему поддержки и нажимаем кнопку «Обратиться в службу поддержки».`}),`
`,(0,n.jsx)(t.p,{children:`Выбираем нужную категорию. Если нужна только техподдержка на платной основе — выбираем её, иначе — «Разработки».`}),`
`,(0,n.jsx)(t.p,{children:(0,n.jsx)(t.img,{alt:`image.png`,src:a})}),`
`,(0,n.jsx)(t.p,{children:`В форме заполняем все нужные поля, описываем проблему и нажимаем «Создать обращение».`}),`
`,(0,n.jsx)(t.h2,{id:`альтернативный-способ`,children:`Альтернативный способ`}),`
`,(0,n.jsx)(t.p,{children:`Переходим на страницу ресурса. Если у ресурса есть репозиторий на GitHub, появится соответствующая кнопка.`}),`
`,(0,n.jsx)(t.p,{children:(0,n.jsx)(t.img,{alt:`image.png`,src:o})}),`
`,(0,n.jsx)(t.h2,{id:`третий-способ`,children:`Третий способ`}),`
`,(0,n.jsx)(t.p,{children:`Только если первые два способа не сработали, задайте вопрос в теме обсуждения ресурса.`})]})}function p(e={}){let{wrapper:t}=e.components||{};return t?(0,n.jsx)(t,{...e,children:(0,n.jsx)(f,{...e})}):f(e)}export{l as _markdown,p as default,s as frontmatter,c as lastModified,u as structuredData,d as toc};